[
    {
        "comments": [
            {
                "comment_id": 0,
                "comment": "Darrell Scott, father of Columbine victim Rachel Joy Scott and founder of Rachels Challenge which I am honored serve on the board of, offered common sense solutions today at the White House. So proud of what his organization has done to avert 7 shootings",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "TJBG3PJP",
                "discourse": "Neutral"
            },
            {
                "comment_id": 1,
                "comment": "Biden demanding ‘gun control’ is hilarious, after the clown gifted Taliban terrorists with 64,363 machine guns, 358,530 assault rifles, and 126,395 pistols, and released the most dangerous arms dealer on the face of the earth for Griner.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "D3LOVNJ7",
                "discourse": "Against"
            },
            {
                "comment_id": 2,
                "comment": "20 precious children and 6 teachers were taken from us at Sandy Hook Elementary School 10 years ago. The tragedy scars us to this day. House Dems will not rest until we end the epidemic of gun violence once and for all.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "JH7MCX8I",
                "discourse": "For"
            },
            {
                "comment_id": 3,
                "comment": "You got Kids in high-school walking around with full-auto switches on their guns and us goofy law abiding gun owners are left w/ semi-automatics crying to the ATF to process our form 1s faster. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "KRNB6EH8",
                "discourse": "Against"
            },
            {
                "comment_id": 4,
                "comment": "All gun control does is ensure only criminals have guns.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "9MJOON4R",
                "discourse": "Against"
            },
            {
                "comment_id": 5,
                "comment": "Baton Rouge Sheriff: \"This is not about gun control, but what is in men's hearts\"",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "LG18FBDI",
                "discourse": "Against"
            },
            {
                "comment_id": 6,
                "comment": "Gun control over the law abiding citizen is unconstitutional and a dangerous pass to more security",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "C3U5U1ZW",
                "discourse": "Against"
            },
            {
                "comment_id": 7,
                "comment": "The AMBER Alert was created almost 30 years ago to notify the public about abducted children and bring them home. Tonight, House Democrats voted to create a similar program to warn about active shooters -- yet another important step to save lives from senseless gun violence.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "3CW92ZPQ",
                "discourse": "For"
            },
            {
                "comment_id": 8,
                "comment": "Bipartisan members of Congress came together to heed the call of families across the country and passed the Bipartisan Safer Communities Act to address the scourge of gun violence in our communities. Kids in schools and communities will be safer because of it.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "D5J9P7IE",
                "discourse": "For"
            },
            {
                "comment_id": 9,
                "comment": "Dems suddenly discover word \"authoritarianism\" Wish they had it in the vocabulary when Obama unilaterally overturned gun, immigration laws",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "AFNNQ2PI",
                "discourse": "Against"
            },
            {
                "comment_id": 10,
                "comment": "66% of Americans want stricter gun laws. 70% of Americans favor Dreamers staying in the US. Perhaps Dems are doing a better job of listening to Americans, while Republicans listen only to their donors and the radical right!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "VQ8ZT8QB",
                "discourse": "For"
            },
            {
                "comment_id": 11,
                "comment": "I'm saddened by the mass shooting that took place in San Jose yesterday, yet another tragedy that took innocent lives from us far too soon. Congress must pass comprehensive gun reform to end this epidemic and send it to President Biden's desk for signature as soon as possible.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "M2IWKXII",
                "discourse": "For"
            },
            {
                "comment_id": 12,
                "comment": "The most comprehensive gun violence prevention and mental health support legislation in the last 30 years is now the law of the land. House Dems will not rest until we end the gun violence epidemic once and for all.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "UKP8G7PI",
                "discourse": "For"
            },
            {
                "comment_id": 13,
                "comment": "On the House Floor participating in Democratic sit-in demanding vote on No Fly No Buy and gun safety legislation",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "A5ARZD41",
                "discourse": "For"
            },
            {
                "comment_id": 14,
                "comment": "The exact same amount of people were killed in the car attack in Texas (8) as were killed in the mass shooting the day before. The former is getting a ton more attention in the media. Why?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "YN64Q9B0",
                "discourse": "Against"
            },
            {
                "comment_id": 15,
                "comment": "House Dems have passed bills to protect ppl w/ pre-existing conditions from losing healthcare protection. And stop gun purchases w/o universal criminal background checks. How many more Americans have to die before Moscow Mitch does his job?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "5YWG1NYV",
                "discourse": "For"
            },
            {
                "comment_id": 16,
                "comment": "A popular lie from the gun control crowd is that \"The AR-15 is only for killing\" or similar nonsense. That is patently untrue. The AR-15 is widely used for recreational shooting, competition and hunting.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "DYIJWXVG",
                "discourse": "Against"
            },
            {
                "comment_id": 17,
                "comment": "These Dems know NOTHING about guns They also know NOTHING about the Constitution and the 2nd Amendment. Trump has been a commonsense bridge builder (signed Fix NICS, banned bump stocks) while protecting the Constitution!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "MZYFF25X",
                "discourse": "Against"
            },
            {
                "comment_id": 18,
                "comment": "Why is it always about taking the firearms? Nothing about the break down of the family or about Rx drugs. Because the total gun confiscation groups are helping to direct the narrative of the media. They don't want any other solutions, unless it leads t",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "DO73SB4O",
                "discourse": "Against"
            },
            {
                "comment_id": 19,
                "comment": "This is how the left works...attack/destroy.....then deny it ever happened,because the left defends your rights",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "97C9UJLJ",
                "discourse": "Neutral"
            },
            {
                "comment_id": 20,
                "comment": "California is number 1 in gun control and number 1 in shooter incidents. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "QYMW0BUU",
                "discourse": "Against"
            },
            {
                "comment_id": 21,
                "comment": "The priorities of this congress seem to be set by Dems rather than by the party supposedly in charge. Dems have defined the terms on the immigration debate from day one. Now they're doing the same on gun control.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "TX5I4VA8",
                "discourse": "Against"
            },
            {
                "comment_id": 22,
                "comment": "America is the only developed country in the world with more guns than people. Enough is enough.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "235G0HOK",
                "discourse": "For"
            },
            {
                "comment_id": 23,
                "comment": "These bills do NOT stop criminals from getting guns, but they do undermine the ability of my constituents many of whom are hunters and sportsmen to exercise their Second Amendment rights.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "51YA32UZ",
                "discourse": "Against"
            },
            {
                "comment_id": 24,
                "comment": "This shooting stole the futures of children, who won't experience joys of graduating from school, chasing a career, falling in love, even starting a family of their own. We hold close all who have lost a loved one to gun violence, as this horrible crime deepens their suffering.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "NRJWQU2H",
                "discourse": "For"
            },
            {
                "comment_id": 25,
                "comment": "My heart breaks for the victims of the shootings in Georgia, their families, and their community. It's so important to offer our support to the Asian American community, which is already experiencing a heightened sense of fear as we see a rise in anti-AAPI hate nationwide.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "H44MQL24",
                "discourse": "Neutral"
            },
            {
                "comment_id": 26,
                "comment": "The gun control debate is intellectually dishonest because the problem is not essentially guns, but the people who use them. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "44ST995X",
                "discourse": "Against"
            },
            {
                "comment_id": 27,
                "comment": "We’re starting to see more and more so called republicans speaking of gun control laws. If we don’t get rid of these fake people. We’re doomed. Our gun rights are spelled out in the US constitution. Anyone saying otherwise is not a Republican. They’re traitors",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "VY9RVKMT",
                "discourse": "Against"
            },
            {
                "comment_id": 28,
                "comment": "In 1994, Congress passed a bipartisan assault weapons ban. Nine categories of semi-automatic weapons were included, like AK-47s and AR-15s. In the 10 years it was law, mass shootings went down. After Republicans let the law expire in 2004, mass shootings tripled.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "63TEIFLO",
                "discourse": "For"
            },
            {
                "comment_id": 29,
                "comment": "There are more than 300 million guns in America. They threaten our children. And the law enforcement community. House Dems have acted to address America's gun violence epidemic. It's time for the Senate to Do Your Job.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "3I9CQTPR",
                "discourse": "For"
            },
            {
                "comment_id": 30,
                "comment": "But wouldn't it make sense to keep weapons away from dangerous people while we're trying to figure out where they come from and how to help them? When someone with suicidal tendencies goes to a hospital they take their shoelaces away as soon as they come",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "U80UAAQ0",
                "discourse": "For"
            },
            {
                "comment_id": 31,
                "comment": "Should we also be able to sue knife and alcohol manufacturers in addition to gun manufacturers when their products cause deaths?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "BYSDKLIK",
                "discourse": "Against"
            },
            {
                "comment_id": 32,
                "comment": "If schools &amp; parents addressed bullying, kids would not develop such rage, until they snap. This has been common denominator since Columbine.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "YJQZ24XT",
                "discourse": "Against"
            },
            {
                "comment_id": 33,
                "comment": "Extreme right-wing ideologues want to impeach President Biden for cracking down on gun violence in America. These are sick people.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "CTHYN8ZG",
                "discourse": "For"
            },
            {
                "comment_id": 34,
                "comment": "Legal gun owners have over 200 million guns and 12 trillion rounds of ammo. Seriously people, if we were a problem, you'd know it. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "QMVUVY65",
                "discourse": "Against"
            },
            {
                "comment_id": 35,
                "comment": "I would be so very upset if this happened to me. What is wrong with people? Just because they can't control crazy people they go after innocent ones.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "0WP3LFDK",
                "discourse": "Neutral"
            },
            {
                "comment_id": 36,
                "comment": "All suspects had numerous prior arrests for robbery, carjacking, auto theft and weapons possession, often while on probation for priors. There were no consequences for this violence so there was no reason for them to stop. And now Areanah Preston is dead.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "5Q8JTA7U",
                "discourse": "Neutral"
            },
            {
                "comment_id": 37,
                "comment": "It happened again this time at UNCC. How many more shootings will destroy communities across our country before senate majority leader puts gun safety above the greed of the NRA lobby? We owe it to the victims and survivors to act.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "UYUGWCLA",
                "discourse": "For"
            },
            {
                "comment_id": 38,
                "comment": "Republicans don't want babies to get murdered, therefore we need gun control. And then you have the obligatory reference to trans people, because mental gymnastics.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "AXCWREQX",
                "discourse": "Against"
            },
            {
                "comment_id": 39,
                "comment": "Gun control advocates don't know shit. The Desert Eagle is not chambered in .50bmg. It is chambered in .50AE, a completely different round.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "7Z42DCKP",
                "discourse": "Against"
            },
            {
                "comment_id": 40,
                "comment": "To honor the memory of the Charleston Nine, we can't be afraid to pass meaningful Gun Safety laws in America",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "F4IW84T6",
                "discourse": "For"
            },
            {
                "comment_id": 41,
                "comment": "Wow. Since 1950, all but 2 public mass shootings have taken place where citizens are banned from carrying guns.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "YRKQD2UH",
                "discourse": "For"
            },
            {
                "comment_id": 42,
                "comment": "Is this guy kidding? House Dems have sent over 400 bills to the Senate legislative graveyard this year. Do YOUR Job. Pass criminal background check legislation on Gun Safety. Or PIPE DOWN.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "AF9Q8B70",
                "discourse": "For"
            },
            {
                "comment_id": 43,
                "comment": "Joined with Scott M Stringer and Metro IAF to urge NYC to join fight re smart gun technology",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "IY8Z3IUN",
                "discourse": "For"
            },
            {
                "comment_id": 44,
                "comment": "The other thing we can do is stop Democrats from releasing violent criminals, rapists and murderers into our communities as well as stop defunding police. Let's go back to what works.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "0HFYPN93",
                "discourse": "Against"
            },
            {
                "comment_id": 45,
                "comment": "Only true idiots can believe gun control will ever work.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "T3DUG1CH",
                "discourse": "Against"
            },
            {
                "comment_id": 46,
                "comment": "Will appear shortly on FOX News Sunday at 10 am to discuss the Ukraine Scandal. The evidence of wrongdoing is breathtaking. The July 25 call between Trump and the Ukrainian President is the smoking gun. Trump's words pulled the trigger.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "WPM0VPIQ",
                "discourse": "Neutral"
            },
            {
                "comment_id": 47,
                "comment": "The left can't win the gun control debate",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "DRC54M51",
                "discourse": "Against"
            },
            {
                "comment_id": 48,
                "comment": "\"Australia has had no mass shootings since 1996...they banned all semi-automatic rifles and all semi-automatic and pump-action shotguns and as a restrictive system of licensing and ownership controls...in 2016, 260,000 illegal firearms were used",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "C5KOC48R",
                "discourse": "Against"
            },
            {
                "comment_id": 49,
                "comment": "The filibuster is an antiquated Senate procedure that is standing in the way of real progress in our country. If we want to expand voting rights, achieve gun reform, and promote equality for all, we must End The Filibuster.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "W06NAXTE",
                "discourse": "For"
            },
            {
                "comment_id": 50,
                "comment": "Plan(to destroy America from w/in), key components: Call yourself moderate even tho youre a radical Marxist, Never admit what you really believe in, Demonize your opponents. LOOK IN THE MIRROR and CALL YOUR OPPONENTS",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "F2JMT1MD",
                "discourse": "Neutral"
            },
            {
                "comment_id": 51,
                "comment": "Gun manufacturers have recklessly flooded our streets with weapons of war. It's time we hold them accountable.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "Z4BTYVQS",
                "discourse": "For"
            },
            {
                "comment_id": 52,
                "comment": "Gun control is the hope that by taking guns away from people who don't commit crimes, by some voodoo magic, criminals will stop committing crimes.  Hope and voodoo magic are not good crime policies.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "Y1YDEL4G",
                "discourse": "Against"
            },
            {
                "comment_id": 53,
                "comment": "\"Hello ma'am. I know you have a perfect driving record, but we're here to confiscate your car because a drunk driver that you don't even know killed 10 people on the interstate\" - gun control in a nutshell.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "GT1H4KEX",
                "discourse": "Against"
            },
            {
                "comment_id": 54,
                "comment": "Drug cartels are walking right into America.Anyone think this is strange they push for gun control before this invasion?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "31HUBNWV",
                "discourse": "Against"
            },
            {
                "comment_id": 55,
                "comment": "At least 29 lives stolen, families broken, communities shattered in El Paso and Dayton within 13 hours. Dozens more wounded. Between those two mass shootings, dozens more were killed and injured by gun violence that didn't make national headlines.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "MU6M1SY3",
                "discourse": "For"
            },
            {
                "comment_id": 56,
                "comment": "The solution is not to control guns, but to control racist democrats who create poor violent ghettos to harvest voter fraud.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "6836N26F",
                "discourse": "Against"
            },
            {
                "comment_id": 57,
                "comment": "Because there are no more traditional family units! We need a return to Mom, Dad, God and discipline!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "P16PJRAN",
                "discourse": "Neutral"
            },
            {
                "comment_id": 58,
                "comment": "I joined our community at the Inland Empire rally to Stop AAPI Hate. Together, we denounced hate and xenophobia and remembered the victims of the Atlanta shootings. Thank you to everyone who is speaking out and standing in solidarity with Asian Americans everywhere.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "70XUQUEP",
                "discourse": "Neutral"
            },
            {
                "comment_id": 59,
                "comment": "Trump has done more to stop gun violence than any of these Dems could ever do... * Passed Fix NICS, closing loopholes in crim background system * Banned bump stocks * Signed STOP School Violence Act, providing grants for school safety Dems are ALL TAL",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "63U0Z5SP",
                "discourse": "Against"
            },
            {
                "comment_id": 60,
                "comment": "Suggestion: Talk about “gun safety,” not “gun control.” Most effective solutions relate to creating a broader culture and expectation of responsible gun ownership, not “banning all guns.”",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "TAYTU71A",
                "discourse": "Neutral"
            },
            {
                "comment_id": 61,
                "comment": "To make things perfectly clear, those who are proposing “gun control” are not proposing the eradication of guns. They are proposing the centralization of firearms in the hands of government, the very definition of totalitarianism. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "GK4VAL4Z",
                "discourse": "Against"
            },
            {
                "comment_id": 62,
                "comment": "I’m 100% for gun control, but we cannot keep guns out of the hands of the same people we expect to defend our Country.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "G0IWZ3YV",
                "discourse": "Neutral"
            },
            {
                "comment_id": 63,
                "comment": "Gun Control is the wrong process to more security. The problem lays within the failed system to apply the most basic means for safety and behavior control. Gun control means deprive the law abiding citizen from own protection and equalize them to the drug",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "EG4TZ3HH",
                "discourse": "Against"
            },
            {
                "comment_id": 64,
                "comment": "The realist talk about the violence rise. We need to start having real conversations about the causes instead of just guns.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "PE2V65PF",
                "discourse": "Neutral"
            },
            {
                "comment_id": 65,
                "comment": "Dems are bringing good-paying manufacturing jobs back home, making it harder to flood our streets with guns and putting people over politics.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "RYKGE3ZO",
                "discourse": "For"
            },
            {
                "comment_id": 66,
                "comment": "Obama potus for 8 years..... Why didn't he do something if dems so convinced gun control a necessity",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "NDQ0NVC3",
                "discourse": "Against"
            },
            {
                "comment_id": 67,
                "comment": "This morning, I signed the Bipartisan Safer Communities Act into the most significant gun safety law in the last 30 years. The bill: Includes red-flag laws closes the boyfriend loophole. Requires young people ages 18 to 21 to undergo enhanced background checks And more.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "XIW1G7GQ",
                "discourse": "For"
            },
            {
                "comment_id": 68,
                "comment": "Why are credit card companies tracking the information of law-abiding gun owners?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "D5NE2CAN",
                "discourse": "Neutral"
            },
            {
                "comment_id": 69,
                "comment": "House Dems are fighting to make it easier to live the American dream and harder to die of gun violence.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "3S6MW2CB",
                "discourse": "For"
            },
            {
                "comment_id": 70,
                "comment": "Will take to the House floor shortly with Rep Beatty and CBC to defend Barack Obama's strong executive actions on gun safety",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "I5FA2HUD",
                "discourse": "For"
            },
            {
                "comment_id": 71,
                "comment": "We don't need gun control.  We need border control.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "YP5PX36W",
                "discourse": "Against"
            },
            {
                "comment_id": 72,
                "comment": "We won't support enforcing the red flag law supported by Democrats, which allows guns to be taken from people deemed a threat to themselves or others.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "ZZC5SBT5",
                "discourse": "Against"
            },
            {
                "comment_id": 73,
                "comment": "Isn't it kind of crazy that with all this gun control talk you only see them trying to take guns away from law- abiding citizens and not the criminals?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "CMGIYJE7",
                "discourse": "Against"
            },
            {
                "comment_id": 74,
                "comment": "Glad to hear reports the White House is taking my advice and pulling the terrible nomination of David Chipman. Absurd that a vocal opponent of Americans' constitutional rights was ever picked to run ATF. This is a win for the Second Amendment and law-abid",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "H9F5IQDP",
                "discourse": "Against"
            },
            {
                "comment_id": 75,
                "comment": "Provide aid and comfort to violent insurrectionists. Oppose gun violence prevention measures. Claim to be about law and order. Phonies.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "G8QYDOM9",
                "discourse": "For"
            },
            {
                "comment_id": 76,
                "comment": "The Fentanyl crisis exposes the hypocrisy of legacy media and the gun control crowd. They don't really care.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "Z349UJTE",
                "discourse": "Against"
            },
            {
                "comment_id": 77,
                "comment": "Rich to hear Kamala talk about \"Congress failure to act\" on mass shootings Last time I checked, Kamala was in Congress Last time I checked, she could go back to DC and work w/ Trump who has actually taken action (Fix NICS, ban bump stocks etc) Instead",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "QJFUFFNU",
                "discourse": "Neutral"
            },
            {
                "comment_id": 78,
                "comment": "hear me out - if you stop crazy people from getting guns. If you stop crazy people from getting guns, they can't do the shit that they do.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "OFSPKQTR",
                "discourse": "For"
            },
            {
                "comment_id": 79,
                "comment": "\"Armed Guard Stops School Shooter Who Shot Classmates\"-- Precisely, armed guards stop shootings, gun control does not",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "C7DKA90F",
                "discourse": "Against"
            },
            {
                "comment_id": 80,
                "comment": "Why are our schools not equally protected like Airports, Federal Buildings, Court Houses. It's not guns. It's our politicians not being willingly to protect our children. Yelling for more gun control is headlines. Providing equal protection for our child",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "APQ6XR8C",
                "discourse": "Against"
            },
            {
                "comment_id": 81,
                "comment": "My beautiful grandfather clearly didn't have a problem with the Second Amendment. He was the real deal!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "JLAF0EMO",
                "discourse": "Against"
            },
            {
                "comment_id": 82,
                "comment": "From the climate crisis to student debt and gun violence there's so much on the line in this election, and young people have the power to own the outcome. So vote, and let's build a better future together.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "7XFXOPIZ",
                "discourse": "For"
            },
            {
                "comment_id": 83,
                "comment": "Criminlas who want go get firearms will do so through illegal, untraceable, unregistered sources, with or without gun control. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "H16MMD4S",
                "discourse": "Against"
            },
            {
                "comment_id": 84,
                "comment": "Move to California where we claim to have gun control, but all the gang members have guns…",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "8ED1N4M9",
                "discourse": "Against"
            },
            {
                "comment_id": 85,
                "comment": "This guy stole a Supreme Court seat from Barack Obama and the American people. Don't ever lecture the House on norms or precedent. You have ZERO credibility. Do something about prescription drug prices and the gun violence epidemic or PIPE DOWN.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "L6LZ3D32",
                "discourse": "For"
            },
            {
                "comment_id": 86,
                "comment": "YOU TEEN MUST BE SNOWFLAKES. CHILDREN DIED BECAUSE OF DERANGED TEENS WITH GUNS. AUTHORITIES ARE JUST DOING THEIR JOB QUESTIONING A TEEN GOING TO A RANGE; SHOULD BE FORCEFUL AND RIGHTFULLY SO! PS I'm a lawful gun owner and don't mind questioning",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "6SUZXOIG",
                "discourse": "For"
            },
            {
                "comment_id": 87,
                "comment": "We passed the most extensive gun legislation in 30 years and I'm not going to rest until we get assault weapons banned. Our kids should be learning how to read and write, not duck and cover.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "T7V25H2V",
                "discourse": "For"
            },
            {
                "comment_id": 88,
                "comment": "Over the last two decades, more school-aged children have died from guns than on-duty police officers and active-duty military combined. Think about that. How much more carnage are we willing to accept? How many more innocent lives must be taken before we say enough?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "KD2L5BVI",
                "discourse": "For"
            },
            {
                "comment_id": 89,
                "comment": "8 years ago, a gunman took the lives of 20 children and 6 educators at Sandy Hook Elementary School. Today, as we mourn this loss, we must commit to passing common sense gun legislation and creating real reform so that this horrific tragedy never happens again.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "LSPK9V5F",
                "discourse": "For"
            },
            {
                "comment_id": 90,
                "comment": "In response to a federal lawsuit, the ATF says it has reclassified the Franklin Armory Reformation as a short-barreled shotgun under both the Gun Control Act and the NFA, instead of just the GCA.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "T2Z03AT5",
                "discourse": "Neutral"
            },
            {
                "comment_id": 91,
                "comment": "The Bipartisan Safer Communities Act closes the \"boyfriend loophole,\" so if you are convicted of assault against a dating partner, you cannot buy a gun. If we keep guns out of the hands of domestic abusers, we can save the lives of their partners and stop more mass shootings.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "LE1QOIHV",
                "discourse": "For"
            },
            {
                "comment_id": 92,
                "comment": "Remember, Criminals and the demented Don't care about laws...that would be senseless. Always is.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "6B2ZW833",
                "discourse": "Against"
            },
            {
                "comment_id": 93,
                "comment": "I've asked Congress to provide $200 million to invest in community violence intervention programs that can interrupt violence, mediate conflict, de-escalate, and succeed in preventing shootings.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "51I1XR7Z",
                "discourse": "For"
            },
            {
                "comment_id": 94,
                "comment": "Sounds like we don't have a gun control problem after all. We have a mental health problem.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "12ST4L6X",
                "discourse": "Neutral"
            },
            {
                "comment_id": 95,
                "comment": "Lower Prescription Drug Prices. Fix America's Crumbling Infrastructure. Address the Gun Violence Epidemic. Defend our Democracy. That's what House Dems are doing For The People.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "QNEWYTJL",
                "discourse": "For"
            },
            {
                "comment_id": 96,
                "comment": "I'm deeply disappointed by the Supreme Court's ruling in New York State Rifle and Pistol Association v. Bruen. This ruling contradicts common sense and the Constitution, and should deeply trouble us all. I remain committed to doing everything in my power to reduce gun violence.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "H2PLYILI",
                "discourse": "For"
            },
            {
                "comment_id": 97,
                "comment": "I hate this fucking country. Get me out. Burn it to the ground. We're so full of self righteous retards that let children die so they can have a gun. I hate it I hate it I hate it I hate it I hate it I hate it I hate it I hate",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "E8MHVIXM",
                "discourse": "For"
            },
            {
                "comment_id": 98,
                "comment": "Remember when conservatives fought against Rap music violent, disrespecting women, hate cops, white people/violence, sex in movies? We knew seeing, hearing this would imprint on kids minds? But Hollywood won and all these sordid things have affected kids",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "98COYW4T",
                "discourse": "Neutral"
            },
            {
                "comment_id": 99,
                "comment": "I vote that we take away guns from people like Tucker, who, based off of this clip, suffer from some sort of severe brain injury.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "R1QSIXP6",
                "discourse": "For"
            },
            {
                "comment_id": 100,
                "comment": "Areas with extreme levels of violence, usually have the most gun control.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "81JVL7Q7",
                "discourse": "Against"
            },
            {
                "comment_id": 101,
                "comment": "Dems delivered the most impactful gun safety law in 30 years, legislation to bring domestic manufacturing jobs back to America and the biggest climate bill in history. Meanwhile. Extreme Republicans continue to blindly defend the cult leader.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "933R2FXF",
                "discourse": "For"
            },
            {
                "comment_id": 102,
                "comment": "If gun control works, why isn't chicago the safest place in America?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "9K8J4SQG",
                "discourse": "Against"
            },
            {
                "comment_id": 103,
                "comment": "The deadliest mass shootings all have one thing in common: assault weapons. It's past time we get these weapons of war off our streets. I've banned them before, and I'll ban them again in the White House.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "IUH2TF3G",
                "discourse": "For"
            },
            {
                "comment_id": 104,
                "comment": "Thankful for young people who will descend on Capitol tomorrow to demand Congress pass gun safety legislation",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "IU7C7K73",
                "discourse": "For"
            },
            {
                "comment_id": 105,
                "comment": "If you had actually ever served your country, gun control is ACTUALLY about enforcing RESPONSIBLE gun ownership, and safety like UOF...",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "ZIUNJ27V",
                "discourse": "For"
            },
            {
                "comment_id": 106,
                "comment": "Obama keeps going back to this hypothetical of people filling up cars with guns. It's time to outlaw minivans…",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "2V06XFVA",
                "discourse": "Against"
            },
            {
                "comment_id": 107,
                "comment": "Once again, a radical Supreme Court went against the will of the people and struck down a democratically implemented gun law. At a time when the U.S. has had more than 250 mass shootings in the first half of 2022, this decision undermines public safety and puts us all at risk.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "KD6OFDI6",
                "discourse": "For"
            },
            {
                "comment_id": 108,
                "comment": "I want to thank the young people of this nation who voted in historic numbers, just as they did two years ago. They voted to continue addressing the climate crisis, gun violence, their personal rights and freedoms, and student debt relief.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "1LXKQG94",
                "discourse": "For"
            },
            {
                "comment_id": 109,
                "comment": "The House GOP led a grisly ritual: shooting, moment of silence, inaction. Well, today is a new day in Congress. We passed HR8, a bill supported by 97% of Americans. Finally, we're putting survivors and our communities ahead of the gun lobby.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "6YOHF45S",
                "discourse": "For"
            },
            {
                "comment_id": 110,
                "comment": "Giffords Courage: This was never about the 2nd Amendment. It was about gun industry profits. This is a huge loss for communities grappling with a rise in gun violence. The only winners here are corporate gun executives and illegal gun traffickers.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "AHQZ3Z1P",
                "discourse": "Neutral"
            },
            {
                "comment_id": 111,
                "comment": "The American people have waited almost 30 years for comprehensive gun violence prevention legislation. It's time to get this done.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "B61G05ZS",
                "discourse": "For"
            },
            {
                "comment_id": 112,
                "comment": "Hundreds of minor children are slaughtered in mass shootings and gun violence. Thousands of God's children have been caged and separated from their families. Millions of American children suffer from hunger. Where is the right wing outrage for their well-being? Phonies.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "0TUWQLYL",
                "discourse": "For"
            },
            {
                "comment_id": 113,
                "comment": "Gun control serves two purposes - increases government control and makes the public defenseless and dependent.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "XD5XRI87",
                "discourse": "Against"
            },
            {
                "comment_id": 114,
                "comment": "259 days into 2019. 300 mass shootings. We cannot go on like this.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "HSHTJVHD",
                "discourse": "For"
            },
            {
                "comment_id": 115,
                "comment": "Because, surprise!..if you're a thug with a gun and you try to use it on a cop, you're going to get shot.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "RY1PQ5CP",
                "discourse": "Neutral"
            },
            {
                "comment_id": 116,
                "comment": "\"Your AR-15 is useless because the government could just carpet bomb you into submission\" isn't an argument in favor of gun control. It's actually an argument for a better armed citizenry and against trusting whoever said that.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "S3QSKJWI",
                "discourse": "Against"
            },
            {
                "comment_id": 117,
                "comment": "Gun control, whether you find the slogans appealing or not, will not stop the next Salvador Ramos. The only way to stop these killings is to figure out why American society is producing so many violent young men.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "605NU6B0",
                "discourse": "Against"
            },
            {
                "comment_id": 118,
                "comment": "This country doesn't need gun control, we just need to enforce current laws, but bad people look at our border and think hey the President doesn't enforce laws he doesn't like so why should we ?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "KYURXPPD",
                "discourse": "Against"
            },
            {
                "comment_id": 119,
                "comment": "According to the Gun Violence Archive, there have been at least 150 mass shootings in 2021. 150 mass shootings in 4 months. We need gun safety legislation. Now.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "T3SMQGO5",
                "discourse": "For"
            },
            {
                "comment_id": 120,
                "comment": "It has now been 264 days. How many more senseless shootings must occur before Senate Republicans take action? Enough is enough.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "2U0L9XPT",
                "discourse": "For"
            },
            {
                "comment_id": 121,
                "comment": "Our schools should be spaces for our children to learn and grow -- not war zones. That's why Democrats passed the Gun Reform Law and why we will continue to fight for common sense gun reform.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "YYDJLVRV",
                "discourse": "For"
            },
            {
                "comment_id": 122,
                "comment": "Liberals support gun control because they can't imagine using a firearm on anyone but themselves",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "O3YEL87X",
                "discourse": "Against"
            },
            {
                "comment_id": 123,
                "comment": "in US, online discourse is \"GUN CONTROL\", meanwhile armed militarised police made up of CIVILIANS kill your dogs if not shoot you on accident with no knock raids not declaring who they are.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "JUJ9TCNJ",
                "discourse": "Neutral"
            },
            {
                "comment_id": 124,
                "comment": "The jist of this particular video is correct. Not his implications that the left has used these children as puppets, but that gun rights is a serious issue that must be considered from all sides. What we will NOT tolerate is inaction.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "43H07DFK",
                "discourse": "Neutral"
            },
            {
                "comment_id": 125,
                "comment": "Examine the shootings that occur in civilized countries with gun laws. Next to zero. Why aren't you using your brain? what if it were your child?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "NYQ2IU4Q",
                "discourse": "For"
            },
            {
                "comment_id": 126,
                "comment": "The left's been opposing some most basic constitutional rights particularly on gun control. This is a country worth living in bc we take the constitution seriously. When we stop doing that it won't be. Trump seems to remember that. Many on the left never",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "JL44SEJU",
                "discourse": "Against"
            },
            {
                "comment_id": 127,
                "comment": "Number of executive orders is irrelevant. What matters is content. Obama has rolled back immigration and gun laws unilaterally. Despotism!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "DNHFU88M",
                "discourse": "Against"
            },
            {
                "comment_id": 128,
                "comment": "If gun control advocates put half as much effort into keeping dangerous repeat offenders out of our communities as they put into trying to ban pistol grips and barrel shrouds, we would be significantly safer in a very short amount of time.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "3JU9XFYF",
                "discourse": "Against"
            },
            {
                "comment_id": 129,
                "comment": "Biden says enhanced background checks stop crime - FALSE. Background checks are already performed. Also, just 1.3% of guns used in crimes are from retail stores; 90% of weapons were obtained illegally. RED HERRINGS do not fix the problem.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "BHRPOJPQ",
                "discourse": "Against"
            },
            {
                "comment_id": 130,
                "comment": "Two people were just shot dead at a Mercedes factory in Sindelfingden, Germany. Per German weapons expert Holger Soschinka: \"Germany has one of the strictest weapons laws worldwide.”",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "OUUKW8F6",
                "discourse": "Against"
            },
            {
                "comment_id": 131,
                "comment": "We stand together to reclaim our community block by block. We pray together to increase the peace. We walk together to stop the gun violence that is killing our young people. We shall overcome.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "RXCK3VA0",
                "discourse": "For"
            },
            {
                "comment_id": 132,
                "comment": "There are some in Congress who go to church and pray on Sunday. But they actively undermine ppl w/ preexisting conditions and stop gun safety legislation. And thereby prey on everyday Americans every other day of the week. This. Must. End.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "8ZPLQ9A3",
                "discourse": "For"
            },
            {
                "comment_id": 133,
                "comment": "At the House Judiciary Committee hearing about gun control, Dems put on full display that they have no idea what they're talking about in gun debates. They don't even know what their own bill would ban! Thanks for the shoutout",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "D4CFD8LZ",
                "discourse": "Against"
            },
            {
                "comment_id": 134,
                "comment": "Stronger law enforcement is critical to stopping gun crime, but it's made more effective when we invest in strengthening our communities. My comprehensive strategy makes sure cities and states have the tools they need to invest in proven, community-based tactics to reduce crime.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "8QEUNBU3",
                "discourse": "For"
            },
            {
                "comment_id": 135,
                "comment": "The President sent a six page diatribe to Speaker Pelosi today. Where does he find the time? He clearly doesn't have enough to do. My suggestion: Take a few moments to work with House Dems on lowering drug costs and addressing gun violence.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "OL8OG2DO",
                "discourse": "For"
            },
            {
                "comment_id": 136,
                "comment": "In the year since the Atlanta Spa Shootings, anti-Asian hate has continued to spike. If we want to honor the 8 people whose lives were taken, and the thousands of other victims across the country, we must speak out against racism and turn our words into actions.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "4B14T9HU",
                "discourse": "Neutral"
            },
            {
                "comment_id": 137,
                "comment": "Gun control WILL NOT stop mass murder! Disarmaments always lead to totalitarianism ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "VBX6735O",
                "discourse": "Against"
            },
            {
                "comment_id": 138,
                "comment": "The right to keep and bear arms doesn't mean every conceivable kind of armament. The right ends where it abridges the rights of others. Just like the right to religion does not allow for those that include the practice of ritual murder.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "NQ8GD41O",
                "discourse": "Neutral"
            },
            {
                "comment_id": 139,
                "comment": "Why don't you talk about extreme violence in movies, young and the mentally unstable are copying",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "TBENUIHV",
                "discourse": "Against"
            },
            {
                "comment_id": 140,
                "comment": "I've added my name to this letter. Conspiracy theorists who deny that deadly school shootings ever happened do not belong on the Education and Labor Committee. Republican leadership needs to take immediate action to remove Rep. Marjorie Taylor Greene from the committee.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "3KTKFPN5",
                "discourse": "Neutral"
            },
            {
                "comment_id": 141,
                "comment": "Every time there's a shooting, like clockwork, Dems emerge from their holes & start yelling about gun control. Never occurs to them that every day in cities with strong gun control, crimes are being committed by thugs who'r magically able to get a gun.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "PC1ZP7T7",
                "discourse": "Against"
            },
            {
                "comment_id": 142,
                "comment": "So should vets with PTSD and domestic abusers be stripped of their rights to gun ownership? Ummmm... yeah! That's pretty much a no-brainer there.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "NWKJ18TE",
                "discourse": "Against"
            },
            {
                "comment_id": 143,
                "comment": "Check out part of my interview with an anti-gun control Parkland teen who says he was interrogated \"like a criminal\" for visiting a gun range.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "G0V18H5D",
                "discourse": "Against"
            },
            {
                "comment_id": 144,
                "comment": "Your perseverance and immeasurable courage continue to inspire me and millions of others. I pledge to continue to work with you and with survivors, families, and advocates across the country to defeat the NRA and end our epidemic of gun violence.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "Z91NNJYP",
                "discourse": "For"
            },
            {
                "comment_id": 145,
                "comment": "The criminals will always find a way to have guns. Gun control does not apply to them. It only takes gun away from law-abiding citizens. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "6CWEP3X3",
                "discourse": "Against"
            },
            {
                "comment_id": 146,
                "comment": "Saddened by another mass shooting and tragic loss of young, innocent lives. At this point, congressional inaction on the gun safety issue is callous and inhumane",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "VABGKFRF",
                "discourse": "For"
            },
            {
                "comment_id": 147,
                "comment": "When I talk about our gun violence epidemic, I'm not only talking about the tragic mass shootings that make national news. I'm also talking about the shootings that occur every day in communities across the nation like Wilmington, Delaware. We must take on the NRA and end this.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "EB9N3JV0",
                "discourse": "For"
            },
            {
                "comment_id": 148,
                "comment": "As a reminder, the people screaming for more gun control are the same people who keep putting repeat violent offenders back on the streets without seriously enforcing existing laws. ",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "Z94RP2EB",
                "discourse": "Against"
            },
            {
                "comment_id": 149,
                "comment": "Lower gas prices, millions of good-paying jobs and gun safety legislation for the first time in 30 years. Democrats deliver for you.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "34PPJMMA",
                "discourse": "For"
            },
            {
                "comment_id": 150,
                "comment": "France has had 5 attacks where guns used were illegal under French law. Gun control does not work. Stop aiming at a straw man.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "WI040QLW",
                "discourse": "Against"
            },
            {
                "comment_id": 151,
                "comment": "Heartbroken and outraged by the slaughter of innocent children and their teacher in the Texas school shooting. We must crush the gun violence epidemic. And the hatred that is fueling it.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "054VJV6T",
                "discourse": "For"
            },
            {
                "comment_id": 152,
                "comment": "Universal background checks criminalize private firearm transfers and make it impossible for law-abiding gun owners to acquire, or borrow/lend, firearms. The bills also give government the ability to delay a firearm transfer indefinitely without proof tha",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "2F9DONRS",
                "discourse": "Against"
            },
            {
                "comment_id": 153,
                "comment": "It's long past time we take action to end the scourge of gun violence in America. As president, I'll ban assault weapons and high-capacity magazines, implement universal background checks, and enact other common-sense reforms to end our gun violence epidemic.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "YOFSPD3G",
                "discourse": "For"
            },
            {
                "comment_id": 154,
                "comment": "One summer. 26 mass shootings. Countless lives cut short. We cannot go on like this. It's past time we take on the NRA, pass common-sense gun safety legislation, and end our gun violence epidemic.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "X6NKGANB",
                "discourse": "For"
            },
            {
                "comment_id": 155,
                "comment": "This is the anti-gun society that I find very disturbing. The media demonizes American gun owners to the extent that their children are harassed by those in positions of authority over them. DISGRACEFUL!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "SLKZUUK9",
                "discourse": "Against"
            },
            {
                "comment_id": 156,
                "comment": "OBAMA 08 RALLY: \"If they bring a knife to the fight, we bring a gun... folks in Philly like a good brawl\" Inciting violence?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "UUZF7ZEW",
                "discourse": "Neutral"
            },
            {
                "comment_id": 157,
                "comment": "It's hilarious when people from Great Britain have an opinion on gun control. They're subject to a king with swollen sausage fingers, they should sit this one out.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "SNX14X4U",
                "discourse": "Against"
            },
            {
                "comment_id": 158,
                "comment": "My heart aches for the lives lost in Odessa, Texas. Thoughts and prayers are not enough. Senate Major Leader we need to pass commonsense gun reform and act NOW.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "D0QX8M7Q",
                "discourse": "For"
            },
            {
                "comment_id": 159,
                "comment": "Politics aside this is a win for anyone who enjoys owning or shooting a gun whether it's for hunting, recreation, or home defense. Also fuck chipman",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "VPP9HYUX",
                "discourse": "Against"
            },
            {
                "comment_id": 160,
                "comment": "House Dems have passed approximately 400 bills For The People. 275 are bipartisan. We address issues like lower healthcare costs and gun violence prevention. Many remain buried in the Senate legislative graveyard . Do. Your. Job. Mitch.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "008MC1UD",
                "discourse": "For"
            },
            {
                "comment_id": 161,
                "comment": "Comparing gun rights to the right to free speech and voting? Nah.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "GCDFDRYY",
                "discourse": "Neutral"
            },
            {
                "comment_id": 162,
                "comment": "We should NEVER accept mass shootings/gun violence as the new normal in America",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "NQI6BQN1",
                "discourse": "For"
            },
            {
                "comment_id": 163,
                "comment": "In 2020, firearms became the leading cause of death for children ages 19 and below. In 2021, seven children per day died by firearm. 2022: Already 500+ mass shootings. While the GOP sticks with the gun lobby, Democrats are working to create safer communities. Enough is enough.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "TX4CRFMN",
                "discourse": "For"
            },
            {
                "comment_id": 164,
                "comment": "Two years ago, a white supremacist entered Pittsburgh's Tree of Life Synagogue and perpetrated the deadliest anti-Semitic attack in American history. May the memories of those we lost be a blessing and may we never stop fighting the scourges of anti-Semitism and gun violence.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "EEMGHW91",
                "discourse": "For"
            },
            {
                "comment_id": 165,
                "comment": "These shootings are a big part of the psych meds, our public is being pushed on them. We're the top drugged country in the world, the psych meds are the top drug. Before they were here, these type of school shootings weren't and neither was 22 vert",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "FSS0FMY0",
                "discourse": "Neutral"
            },
            {
                "comment_id": 166,
                "comment": "It shouldn't take a global pandemic shutting down schools to end school shootings.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "5YAG29ZH",
                "discourse": "For"
            },
            {
                "comment_id": 167,
                "comment": "Yeah, it totally won't stop the next one, it just would have stopped him, and a vast majority of other mass shooters before him.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "Y6QEU5ME",
                "discourse": "For"
            },
            {
                "comment_id": 168,
                "comment": "I'd like to thank members of the House and Senate for working to get the Bipartisan Safer Communities Act done, and the families I've met with who lost loved ones to gun violence. They led the way so other families won't have to experience the pain they had to live through.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "A94K8VIN",
                "discourse": "For"
            },
            {
                "comment_id": 169,
                "comment": "The only people obeying the gun laws are the law abiding. Ironic isn't it? Considering all the laws target the non-law abiding, which is the fundamental flaw the 'gun control' sphere doesn't seem to grasp.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "BJ999OL7",
                "discourse": "Against"
            },
            {
                "comment_id": 170,
                "comment": "Gun control morons have only one joke and it's always sexual, anti trans, body shaming rhetoric.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "P7UGACUH",
                "discourse": "Against"
            },
            {
                "comment_id": 171,
                "comment": "Because most Americans are immoral and violent and you're one of them. When the state religion is gun worship what do you expect? Guns exist to be used.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "U9098RWT",
                "discourse": "For"
            },
            {
                "comment_id": 172,
                "comment": "Guns don't pull the trigger, people do.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "CK74IV15",
                "discourse": "Against"
            },
            {
                "comment_id": 173,
                "comment": "Trump abused his power by pressuring a foreign government to interfere in the 2020 election. His admission to doing so effectively constitutes a GUILTY PLEA. He. Is. The. Smoking. Gun.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "B7LX7UI0",
                "discourse": "Neutral"
            },
            {
                "comment_id": 174,
                "comment": "House Democrats have passed more than 400 bills. This includes monumental gun safety and healthcare legislation that will save lives. But the Senate Republicans refuse to act. Is it time to repeal and replace the DO NOTHING SENATE?",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "JIW885PG",
                "discourse": "For"
            },
            {
                "comment_id": 175,
                "comment": "With over 85% of Americans fearing rising crime rates, taking away gun rights from law-abiding citizens puts them in danger.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "GAB5E712",
                "discourse": "Against"
            },
            {
                "comment_id": 176,
                "comment": "19 years ago Rachel Joy Scott was killed at Columbine. Her funeral was the most viewed TV on CNN at that point and she has averted 7 shootings overall and 150 suicides per yr. Her legacy continues to change lives.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "X2IZD6IO",
                "discourse": "Neutral"
            },
            {
                "comment_id": 177,
                "comment": "These kinds of mass shootings rarely happen anywhere else in the world. Why are we willing to live with this carnage? Where in God's name is our backbone to have the courage to stand up to the gun lobby? It is time to turn this pain into action.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "XV5JO2OY",
                "discourse": "For"
            },
            {
                "comment_id": 178,
                "comment": "It's tragic that the left is obsessed by Gun control… not Crime control.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "QLW6FMN1",
                "discourse": "Against"
            },
            {
                "comment_id": 179,
                "comment": "Officer Wilbert Mora is a hero who lost his life protecting and serving our community. We must be there for his family and loved ones. And recommit to crushing the gun violence epidemic in America.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "3PR24PIF",
                "discourse": "For"
            },
            {
                "comment_id": 180,
                "comment": "7 years after the Mother Emanuel shooting in SC, Republicans have still refused to close the Charleston Loophole that could have prevented that shooter - and other potentially dangerous people - from getting a gun. It is time to change our laws to save lives and End Gun Violence",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "I62GBIFY",
                "discourse": "For"
            },
            {
                "comment_id": 181,
                "comment": "The Democratic approach to guns is to wait until there is a mass shooting and then demand more gun control",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "ZQ4SJ4O5",
                "discourse": "Against"
            },
            {
                "comment_id": 182,
                "comment": "The Democrats are unleashing into America a tidal wave of registered foreign military, terrorists, known felons, gang members, etc. intermixed with squat pregnant women and children.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "E68JUW3R",
                "discourse": "Against"
            },
            {
                "comment_id": 183,
                "comment": "House Dems passed Criminal Background Check legislation in February on Gun Safety. Senate Republicans failed to act. Americans are being massacred. Mitch and Co. return to DC tomorrow. Do. Your. Job.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "9XVWFTHA",
                "discourse": "For"
            },
            {
                "comment_id": 184,
                "comment": "So Democrats aren’t willing to cut a dime in spending. Republicans were willing to give them a $1.2 trillion “infrastructure” bill and gun control. Must be awesome to be a Democrat.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "2UTE1QZ6",
                "discourse": "Neutral"
            },
            {
                "comment_id": 185,
                "comment": "At a time when we are all searching for solutions, I want to point to Rachels Challenge which has averted 7 shootings overall and 150 suicides per year by teaching students about love, respect, and self-worth. They have reached more than 25 million studen",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "C5PU5JBO",
                "discourse": "Neutral"
            },
            {
                "comment_id": 186,
                "comment": "Ant why not...AMERICANS want sensible gun laws. Mental illness needs addressing also. This was the 273 rd. mass shooting in our country.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "4RMCR1SQ",
                "discourse": "For"
            },
            {
                "comment_id": 187,
                "comment": "Want to stop drunk drivers from killing sober drivers? Ban sober drivers from driving. That's how gun control works",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "TFZ9PWZD",
                "discourse": "Against"
            },
            {
                "comment_id": 188,
                "comment": "The second amendment didn't disarm the slaves, gun control did. Racist slave owners pushed for gun control laws on enslaved and free slaves, citing a need for public safety; kind of like how Democrats are citing a need for gun control now for public safety.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "6DLGZ4ON",
                "discourse": "Against"
            },
            {
                "comment_id": 189,
                "comment": "Dems always jumping to GunControl instead of dealing with failed Fed and local systems shows their true intentions.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "UU1SHAPI",
                "discourse": "Neutral"
            },
            {
                "comment_id": 190,
                "comment": "I will say it again. We have a serious mental health. It needs to be addressed. Bashing young men and trying to erase young woman aren't helping the matter at all!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "UM8OMB1K",
                "discourse": "Neutral"
            },
            {
                "comment_id": 191,
                "comment": "\"Unless u have been a victim of gun violence, u aren't allowed to have an opinion on gun control.\" - I have been a victim. My life could have gone so differently (or ended) at times the bad guys were armed & I wasnt.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "INKC6ZR9",
                "discourse": "Against"
            },
            {
                "comment_id": 192,
                "comment": "Umm...90% of crimes w/ a gun are from illegal guns...but they can be legally purchased, but stolen. But the notion is that legal gun owners are roughly 1.5% of crime... Here's a link... AND I provided a link from WAPO, of all folks, from 2016.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "14TQAVT5",
                "discourse": "Neutral"
            },
            {
                "comment_id": 193,
                "comment": "A one-year-old boy was killed last night by a stray bullet. Struck down near a playground in Bedford Stuyvesant. Gun violence IS a public health crisis. We must stop it with the fierce urgency of now.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "ZL2N3LSG",
                "discourse": "For"
            },
            {
                "comment_id": 194,
                "comment": "Yes there are mentally unstable people in the US and every country. But only in America can an unstable 18 yr old get a military grade rifle w/o a background check. WE NEED GUN SAFETY LAWS NOW! Its our only hope!!",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "UKI0LVRD",
                "discourse": "For"
            },
            {
                "comment_id": 195,
                "comment": "June is Pride Month and there's so much to celebrate but we also have to recognize that the LGBTQ community suffers disproportionately from gun violence. We have the opportunity to do something about it, so this Pride Month, let's pass bills that can End Gun Violence and save lives.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "4CBJ5816",
                "discourse": "For"
            },
            {
                "comment_id": 196,
                "comment": "\"There are two kinds of men when a situation arises; those that run toward it and the ones that run away...\" Officer Winebrenner confronted danger and died a hero. He told his sister he'd take her to fire her first gun. Despite his passing, he showed up",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "VDTPL8WJ",
                "discourse": "Against"
            },
            {
                "comment_id": 197,
                "comment": "Banning drugs, however appealing, will not stop the next drug addict. The only way to stop drug abuse is to find out why American society is producing so many addiction-prone young people",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "RTR41NAD",
                "discourse": "Against"
            },
            {
                "comment_id": 198,
                "comment": "In a country that has seen more than 200 mass shootings over the course of six months, I Wear Orange to call attention to gun violence, and stand in solidarity with families and loved ones in Uvalde and Buffalo. Until Congress acts, our neighborhoods will not be safe.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "4C7EVMU2",
                "discourse": "For"
            },
            {
                "comment_id": 199,
                "comment": "Prescription drug affordability. Protecting people w/ pre-existing health conditions. Addressing gun violence epidemic through universal background checks. HouseDemocrats have acted decisively For The People. Moscow Mitch and Senate Republicans must DO THEIR JOB.",
                "related_to": "Gun Control",
                "discussion_id": "GC",
                "discussion_name": "Gun Control",
                "user_id": "WLRMFBJM",
                "discourse": "For"
            }
        ],
        "discourses": [
            {
                "discourse_name": "For",
                "count": 85
            },
            {
                "discourse_name": "Against",
                "count": 81
            },
            {
                "discourse_name": "Neutral",
                "count": 34
            }
        ],
        "discussion_id": "GC",
        "discussion_name": "Gun Control",
        "number_of_comments": 200,
        "ngrams": [
            {
                "ngram": "gun control",
                "count": 57
            },
            {
                "ngram": "gun violence",
                "count": 35
            },
            {
                "ngram": "mass shootings",
                "count": 18
            },
            {
                "ngram": "gun safety",
                "count": 13
            },
            {
                "ngram": "house dems",
                "count": 10
            },
            {
                "ngram": "violence epidemic",
                "count": 9
            },
            {
                "ngram": "background check",
                "count": 6
            },
            {
                "ngram": "safety legislation",
                "count": 6
            }
        ]
    },
    {
        "comments": [
            {
                "comment_id": 0,
                "comment": "PASSED THE HOUSE: the Fairness for High-Skilled Immigrants Act, a bill I cosponsored. I have long advocated for modernization and ; reform of our broken immigration system - this bill will attract and retain high-skilled workers talented in their fields.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "KFO3WEI0",
                "discourse": "For"
            },
            {
                "comment_id": 1,
                "comment": "“Grab 'em by the pu*%y” (women). “Sh*thole countries” (African nations). “Drug smugglers and rapists” (Mexican immigrants). “Sons of bitc$es” (Black NFL players). And this guy says IMPEACHMENT is an ugly word? Laughable.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "Z12L84OR",
                "discourse": "Neutral"
            },
            {
                "comment_id": 2,
                "comment": "How does that even make sense? Illegal immigrants do not have the right to vote in our election. Just like we don't vote in any other foreign election!",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "9HIKK3OG",
                "discourse": "For"
            },
            {
                "comment_id": 3,
                "comment": ".POTUS' framework is a compassionate resolution for the illegal immigrants who were brought to this country as children. It offers a generous solution for those 1.8 million that goes well beyond what many anticipated he would offer.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "1CE4XTL6",
                "discourse": "Neutral"
            },
            {
                "comment_id": 4,
                "comment": "Today JoeBiden and ; HouseDemocrats unveiled the U.S. Citizenship Act, comprehensive immigration reform which honors our legacy as a nation of immigrants, respects dignity and humanity and turns the page on the last 4 years of fear. Change is coming.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "TOJLPEKV",
                "discourse": "For"
            },
            {
                "comment_id": 5,
                "comment": "Judge Garland’s story — and his commitment to paying back the country that gave his family so much — deeply resonates with children of immigrants like me. Merrick Garland is a kind, decent and honorable public servant. And he’s going to be an incredible Attorney General.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "EMU7I54Y",
                "discourse": "For"
            },
            {
                "comment_id": 6,
                "comment": "The Biden administration inherited a broken immigration system. Republicans think cruelty can fix it. America should choose family values and compassion.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "O2DB3B5A",
                "discourse": "For"
            },
            {
                "comment_id": 7,
                "comment": "We are in a battle for the soul of this nation. Donald Trump: - Fans the flames of hate and emboldens white supremacists - Embraces dictators - Rips children from their parents' arms - Spouts racist lies about immigrants We have to get him out of the White House.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LV95CRD2",
                "discourse": "For"
            },
            {
                "comment_id": 8,
                "comment": "From taking measures to crush this virus and provide immediate relief to families, to creating a more just immigration system and tackling climate change, POTUS is taking bold action in the first days of his administration to deliver for Americans.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "4DSTE1FD",
                "discourse": "For"
            },
            {
                "comment_id": 9,
                "comment": "The disaster at our border is a direct result of the Biden Administration ending Trump border policies that curbed illegal immigration, the influx of drugs, and human smuggling.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WWO4IETD",
                "discourse": "Against"
            },
            {
                "comment_id": 10,
                "comment": "Comprehensive immigration reform took a significant step forward this week, but there is still work to do:",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "190NIXYO",
                "discourse": "For"
            },
            {
                "comment_id": 11,
                "comment": "Straight from the horses mouth illegal immigration is hurting Black Americans and it’s very intentional",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JTXUUXBN",
                "discourse": "Against"
            },
            {
                "comment_id": 12,
                "comment": "The Trump Administration is now seeking to detain young children and families indefinitely. They continue to pursue cruel and inhumane treatment of immigrants at all costs. The courts should block this and we should all denounce it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "DOA27G1X",
                "discourse": "For"
            },
            {
                "comment_id": 13,
                "comment": "Biden has put out a welcome map as 7 million have poured in since he took office. A controlled demolition of our country as we watch",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "0WOF2KLH",
                "discourse": "Against"
            },
            {
                "comment_id": 14,
                "comment": "House Democrats’ huge new bill would cut taxes for blue-state millionaires, send government checks to illegal immigrants, and — wait for it — mandate two separate taxpayer-funded studies of diversity in the cannabis industry. This is their effort at coronavirus relief?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "BZNB1DSO",
                "discourse": "Against"
            },
            {
                "comment_id": 15,
                "comment": "Law and ; order is breaking down in CA. Oakland mayor Schaaf warned illegal immigrants ahead of an ICE raid, allowing them to flee. Now, 3 of those illegal immigrants have been arrested for new crimes. This could have been avoided if not for Schaaf, she says she did nothing wrong.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "NHC9NKO7",
                "discourse": "Against"
            },
            {
                "comment_id": 16,
                "comment": "#Dreamers are some of the best and brightest in their communities and an asset to our country, but they're barred from federal service by outdated immigration laws. I'm proud to announce we're another step closer to fixing that.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "YV9XSA4S",
                "discourse": "For"
            },
            {
                "comment_id": 17,
                "comment": "Democrats see no difference in legal vs. Illegal immigrants. Vote like your life depends on it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "GZYED0S1",
                "discourse": "Against"
            },
            {
                "comment_id": 18,
                "comment": "Donald Trump is the problem with our immigration policy. He's using family separation as a weapon against desperate people seeking safety and a better life. We need to defeat Donald Trump.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "BBBDRQ59",
                "discourse": "For"
            },
            {
                "comment_id": 19,
                "comment": "The president has never been a reliable negotiating partner, and this administration has always been more interested in cutting legal immigration and separating families than actual reform.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "HYKGTMZ7",
                "discourse": "For"
            },
            {
                "comment_id": 20,
                "comment": "It is being reported that illegal immigrants being released into the USA do not have to appear in court until 2032. This is Biden’s way of making illegal immigration, legal.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "KMZZDXBQ",
                "discourse": "Against"
            },
            {
                "comment_id": 21,
                "comment": "bullshit argument, you are only virtue signaling. US Citizens deserve for ALL IMMIGRANTS to follow the LAWS of the United States of America WITHOUT wanna be politicians working for immigrants over the citizens of our ONCE GREAT nation. It is not longer great thanks to YOU!!",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "X9PB5XJW",
                "discourse": "Against"
            },
            {
                "comment_id": 22,
                "comment": "As we close out Hispanic Heritage Month, we are grateful for the generations of Latino immigrants, activists, workers, and trailblazers who paved the way for us. We honor them by working to ensure no one in our community is let behind or excluded.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "8DYUQ80I",
                "discourse": "For"
            },
            {
                "comment_id": 23,
                "comment": "Mr. President, immigration isn’t the problem. White nationalism is the problem. America’s inaction on gun safety legislation is the problem. It’s time to put the politics aside and pass universal background checks and an assault weapons ban. Lives depend on it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "5MW3MRUD",
                "discourse": "For"
            },
            {
                "comment_id": 24,
                "comment": "This administration's demonization of immigrants must end.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "I64CWFBA",
                "discourse": "For"
            },
            {
                "comment_id": 25,
                "comment": "RepJoeNeguse You stood in that chamber as a traitorous who decided to put immigrants before (actual taxpaying, American citizens) who built this country for free and laid the ground work for \"black\" people like you to prosper here",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JZMZMCXL",
                "discourse": "Against"
            },
            {
                "comment_id": 26,
                "comment": "There r illegal immigrants here who just want to feed ther families and ; reject criminal behavior and th criminal minded expose thm and ; make thm look bad. REMOVE TH CRIMINALS POTUS W/OUT APOLOGY",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "E9XP3GXE",
                "discourse": "Against"
            },
            {
                "comment_id": 27,
                "comment": "Yesterday, all 211 House Democrats voted to keep our southern border wide open and incentivize more illegal immigration. Senate Democrats need to put our country ahead of party and vote to stop the chaos at the border.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "QH8XG4C9",
                "discourse": "Against"
            },
            {
                "comment_id": 28,
                "comment": "We’re a nation of immigrants, but under the Trump Administration we failed to live up to our values. Now, we have an opportunity to refocus our efforts to ensure USCIS is running efficiently so that we can reduce the immigration backlog.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "VUNZVTU5",
                "discourse": "For"
            },
            {
                "comment_id": 29,
                "comment": "Our country was built on the backs of slaves, immigrants and the hardworking women/men of organized labor. We should honor their sacrifice by fighting for and for everyday Americans",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LITDW1ZV",
                "discourse": "For"
            },
            {
                "comment_id": 30,
                "comment": "Senate Republicans take Supreme Court obstruction to a new level, while HouseGOP sinks to a new immigration low",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "K1LXL818",
                "discourse": "Neutral"
            },
            {
                "comment_id": 31,
                "comment": "Trump falsely claimed (again) to congressional leaders this evening that illegal immigrants cost him the popular vote. Wow. Liar-in-chief?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "VWGQ1LQO",
                "discourse": "For"
            },
            {
                "comment_id": 32,
                "comment": "My guest will be Elias, an immigrant and CSU student from who has lived in the U.S. since he was very young. At a time when our national discourse is solely focused on partisan differences over immigration reform, it is so important to be lifting up stories like his.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "S1KB7XTD",
                "discourse": "For"
            },
            {
                "comment_id": 33,
                "comment": "The failed Paris deal will hurt American families while China and Russia grow emissions. The Keystone cancellation will kill union jobs and hurt U.S. energy security. And a proposal to gut immigration enforcement and give blanket amnesty? Rough \"day one\" for American workers.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "QQ1D9UD1",
                "discourse": "Against"
            },
            {
                "comment_id": 34,
                "comment": "As a son of immigrants, is especially important to me. To all of our nation's immigrants, I want to say your home is here. This month and always, we will",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LQ42NW7Z",
                "discourse": "For"
            },
            {
                "comment_id": 35,
                "comment": "Congress must and we will continue to provide needed oversight of this Administration’s cruel and dangerous immigration policies and demand that this Administration treat individuals seeking refuge in our nation with basic human decency",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "95NSUIKJ",
                "discourse": "For"
            },
            {
                "comment_id": 36,
                "comment": "Every time people have stood in front of a ballot box, they have refused to give democratic consent to higher immigration levels.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WTRC1OAJ",
                "discourse": "Against"
            },
            {
                "comment_id": 37,
                "comment": "San Francisco to pay $190,000 to an undocumented immigrant because of a sanctuary city \"violation\"",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "L9ZOUL6D",
                "discourse": "Against"
            },
            {
                "comment_id": 38,
                "comment": ".JoeBiden’s plan is promising but “reinstating DACA” falls short from the promise of certainty and ; security for hundreds of thousands of young immigrants. It’s time to offer more than 2 year increments for young people to truly live dignified lives, free from fear of deportation.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WL3DOASE",
                "discourse": "For"
            },
            {
                "comment_id": 39,
                "comment": "On Saturday the 13th of May, there will be a rally against immigration outside of Parliament House. We are organising against the government’s planned importation of over 700,000 immigrants in the next 2 years.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "SO51BKFB",
                "discourse": "Against"
            },
            {
                "comment_id": 40,
                "comment": "While Chuck and Nancy used their primetime address to attack President realDonaldTrump, the President used the moment to highlight both the plight of American families affected by illegal immigration and the perilous journey for illegal immigrants. What a contrast!",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "I2D0KXWN",
                "discourse": "Against"
            },
            {
                "comment_id": 41,
                "comment": "Our immigration system is broken, and we’re going to have to work across the aisle to fix it. Yesterday, I had a great conversation with my colleagues RepLujanGrisham and HurdOnTheHill about how we’re working to solve these problems with real bipartisan solutions.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "1VGGQ86U",
                "discourse": "Neutral"
            },
            {
                "comment_id": 42,
                "comment": "As the son of immigrants, I will always be a fearless fighter for the 800,000 immigrant youth who are living in fear and uncertainty without a permanent fix for Today, I'm proud to help introduce the 2019 Dream Act w/ SpeakerPelosi and ; RepRoybalAllard",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "J1Q5QZE4",
                "discourse": "For"
            },
            {
                "comment_id": 43,
                "comment": "I think the Biden administration’s handling of immigration plus the lack of mass protest against it is damning. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "IADQRE8G",
                "discourse": "Against"
            },
            {
                "comment_id": 44,
                "comment": "Paying illegal immigrants hundreds of millions of taxpayer dollars for \"damages\" is a slap in the face to hardworking Americans and individuals who legally immigrated to our country.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "9R8C04M6",
                "discourse": "Against"
            },
            {
                "comment_id": 45,
                "comment": " Thanks to Joe Biden immigration policies, a gang members from Latin America. Invasion it’s on his way. Overrun in the black community. White folks do not want them in their community.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "DGDO4YFR",
                "discourse": "Against"
            },
            {
                "comment_id": 46,
                "comment": "If realDonaldTrump is serious about reforming our broken immigration system, he needs to re-open the government. Once the shutdown is over we can start negotiating. Hopefully he won’t walk away from the table again.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "003D4XV9",
                "discourse": "For"
            },
            {
                "comment_id": 47,
                "comment": "If government wanted to create an ugly, racist & violent far right (as opposed to the fantasy one that lives in the heads of media fools) it couldn't do better than to make an accomodation famine & use asylum system for economic immigration.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "BIRV7RPH",
                "discourse": "Against"
            },
            {
                "comment_id": 48,
                "comment": "Tonight, instead of highlighting places where we can work together, the President returned to his campaign rhetoric of demonizing immigrants, pushing false narratives, and painting the world in stark and grim terms.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "H6EUCR8R",
                "discourse": "For"
            },
            {
                "comment_id": 49,
                "comment": "Donald Trump's \"Remain in Mexico\" policy is dangerous, inhumane, and goes against everything we stand for as a nation of immigrants. My administration will end it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "AHLZGLPI",
                "discourse": "For"
            },
            {
                "comment_id": 50,
                "comment": "I’m joining my colleagues in asking DHSGov to strengthen protections for Documented Dreamers. For young immigrants who have grown up knowing no other home but America, we must ensure that their home is — and remains — here.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "FX34H5A5",
                "discourse": "For"
            },
            {
                "comment_id": 51,
                "comment": "Illegals aren’t citizens Joe. You should know that.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "A4EXPFCS",
                "discourse": "Against"
            },
            {
                "comment_id": 52,
                "comment": "Immigration has always made us stronger—it’s essential to who we are. But Donald Trump has waged an assault on our values as a nation of immigrants. As president, I'll undo Trump’s damage and put our values back at the heart of our immigration system:",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "8MUMCFBT",
                "discourse": "For"
            },
            {
                "comment_id": 53,
                "comment": "It was the Liberals who started the dreadful extremist immigration program back in the 2000s & have always supported it, despite their own voters strongly opposing it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "C52VE8TL",
                "discourse": "Neutral"
            },
            {
                "comment_id": 54,
                "comment": "Black People in Chicago are protesting illegal immigration b/c they are most affected by illegal immigration. Resources, schools, hospitals, housing  are stretched to the limits.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "S77SA8PL",
                "discourse": "Against"
            },
            {
                "comment_id": 55,
                "comment": "It is a moral failing when children are ripped from their parents' arms, locked away in overcrowded detention centers, and denied toothbrushes and soap. We have to end Donald Trump's cruel policies and build a fair and humane immigration system.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "7O6170P0",
                "discourse": "For"
            },
            {
                "comment_id": 56,
                "comment": "So many towns have been transformed out of all recognition by mass immigration",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "E8CAUEE5",
                "discourse": "Against"
            },
            {
                "comment_id": 57,
                "comment": "It is incredible to see the mentality in academia. \"Climate crisis\" taken for granted. Mass MASS immigration assumed to be both inevitable and perfectly fine, including the total destruction of countries and ethnic groups. Native Europeans deemed an uppity obstacle in the way.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WSPZZ8VV",
                "discourse": "Neutral"
            },
            {
                "comment_id": 58,
                "comment": "Dinghy immigration cheats force us to spend our foreign aid money on housing them, therefore diverting money we could spend on real refugees - so don't preach to me about \"moral obligations\".",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "YW629QKH",
                "discourse": "Against"
            },
            {
                "comment_id": 59,
                "comment": "If Eric Adams and Kathy Hochul were serious about ending illegal immigration, they would call on Biden to secure the southern border and end his flights of migrants to New York State. Instead, they are passing the buck and ; blaming conservative governors whose borders are in chaos.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JKP89RCA",
                "discourse": "Against"
            },
            {
                "comment_id": 60,
                "comment": "I think the immigration bill is politically unworkable, I think it is legally doubtful, and I think it is morally indefensible.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "5CBI3P8Y",
                "discourse": "Against"
            },
            {
                "comment_id": 61,
                "comment": "Donald Trump’s inhumane, fear-based immigration policies are a stain on our nation. We have to get him out of the White House and ensure our laws reflect our values as a nation of immigrants.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "190QNHWP",
                "discourse": "For"
            },
            {
                "comment_id": 62,
                "comment": "We don't need gun control, we need border control",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LEJDZ8VN",
                "discourse": "Against"
            },
            {
                "comment_id": 63,
                "comment": "Dreamers represent some of our best and brightest, but our broken immigration system has barred them from public service. Proud that my amendment to allow DACA recipients to serve in the federal government is one step closer to becoming law.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "T975K1VF",
                "discourse": "For"
            },
            {
                "comment_id": 64,
                "comment": "In Florida, we take what is happening at the southern border seriously. We are not a sanctuary state, and we will gladly facilitate the transport of illegal immigrants to sanctuary jurisdictions.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "D8WSWV0E",
                "discourse": "Against"
            },
            {
                "comment_id": 65,
                "comment": "Biden has stopped border wall construction, resumed catch-and-release, and wants to provide mass amnesty for millions of illegal immigrants. This has resulted in an increase in human trafficking, drug smuggling, crime, and a lack of respect for our existing immigration system",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "AGV1OQ9H",
                "discourse": "Against"
            },
            {
                "comment_id": 66,
                "comment": "The Biden administration is imposing mandates on legal, essential Northern Border travel. At the same time, they are incentivizing illegal immigration at our southern border. Their hypocrisy knows no bounds.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "F81KV8I8",
                "discourse": "Against"
            },
            {
                "comment_id": 67,
                "comment": "I find it interesting that democrats want so desperately to defend illegal immigration to make sure their work mules don't get legal minimum wage, health insurance, or basic workers rights.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "X2FSHI4N",
                "discourse": "Against"
            },
            {
                "comment_id": 68,
                "comment": "Local economies like ours in San Bernardino County rely on the contributions of immigrants, and this administration’s anti-immigrant agenda hurts small businesses like the ones in the Inland Empire.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "UZEA10UF",
                "discourse": "For"
            },
            {
                "comment_id": 69,
                "comment": "As the son of African immigrants, the shelter and freedom provided to refugees from around the world in the U.S. is not abstract to me. Thank you POTUS for showing the U.S. can lead again on refugee resettlement.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "MEKC1WR6",
                "discourse": "For"
            },
            {
                "comment_id": 70,
                "comment": "#ImmigrantHeritageMonth is all about celebrating the accomplishments and legacies of those who made immeasurable sacrifices to start lives in this country. I was proud to spend a day working at Tacos Don Ramon, an immigrant-owned business in our community.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "USZK1VLP",
                "discourse": "For"
            },
            {
                "comment_id": 71,
                "comment": "Whether you need assistance with an immigration case or you're having trouble dealing with the IRS, my office is here to help. Learn more about the work we do to help Inland Empire residents navigate federal agencies here:",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "ZGYD7PE7",
                "discourse": "For"
            },
            {
                "comment_id": 72,
                "comment": "As if the rental crisis couldn't be getting worse, now university staff are being asked to house international students. Yet no one in the university system will speak out against our extremist immigration program. This is extraordinary madness.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "RL3V3Q6E",
                "discourse": "Against"
            },
            {
                "comment_id": 73,
                "comment": "Immigrants and supporters of mass immigration always use the argument that 'we owe them' because of our past. No. We owe them nothing.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "K7CGXPOO",
                "discourse": "Against"
            },
            {
                "comment_id": 74,
                "comment": "Real comprehensive immigration reform must involve a pathway toward citizenship",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "9CCPPYS9",
                "discourse": "For"
            },
            {
                "comment_id": 75,
                "comment": "The border between the U.S. and Mexico was relatively calm, offering few signs of the chaos that was feared following a rush by worried migrants to enter the U.S. before the end of pandemic-related immigration restrictions.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "W6RRVNVR",
                "discourse": "Against"
            },
            {
                "comment_id": 76,
                "comment": "Illegal immigrants are being given better treatment and special privileges because they are here illegally. It is hard to imagine that an American citizen would have been acquitted of charges in the Steinle case FoxNews",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "QSVEV8V0",
                "discourse": "Against"
            },
            {
                "comment_id": 77,
                "comment": "“The Bible says we must welcome the foreigner so that means we need unfettered immigration!” The Bible distinguishes between the native and the foreigner showing they don’t have the same rights When you have someone over for dinner you don’t have to make them part of the family",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LTQ5ZOBO",
                "discourse": "Against"
            },
            {
                "comment_id": 78,
                "comment": "Voters looking to become American citizens need to understand a vote for Bernie Sanders to be the Democrat Party presidential nominee is a vote against a path to citizenship. The choice is yours.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "IRYN3P9S",
                "discourse": "For"
            },
            {
                "comment_id": 79,
                "comment": "1) Half the world is a \"dangerous situation\". 2) Most of the people crossing our southern border are opportunists, not refugees. 3) All of them have paid $3-$6,000 dollars/person to cartels to cross their territory. Do real refugees have that kind of money?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "66OCD94H",
                "discourse": "Against"
            },
            {
                "comment_id": 80,
                "comment": "Honored to be joined for tonight’s by Sr. Hortencia Del Villar, Director of Social Concerns of the Catholic Diocese of San Bernardino and immigrant-rights advocate. Few people are more dedicated to equality and justice within our community.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "CP6EGQ5Q",
                "discourse": "For"
            },
            {
                "comment_id": 81,
                "comment": "House GOP again abandons reform with a manufactured excuse about trust. Instead of opportunity, we get more obstruction.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "1BKVJSTJ",
                "discourse": "For"
            },
            {
                "comment_id": 82,
                "comment": "Keeping Americans safe does not need to be a partisan issue and ; addressing important safety issues along w, border security, and other parts of our broken immigration system is our best chance to produce legislation that can pass the House,, and earn POTUS' signature",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "9FUCAZUC",
                "discourse": "Neutral"
            },
            {
                "comment_id": 83,
                "comment": ".Raul_Labrador: Democrats want to shutdown the government bc they want to make the priorities of illegal immigrants more important than those of American citizens FoxNews",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "G07EHQ6Z",
                "discourse": "Against"
            },
            {
                "comment_id": 84,
                "comment": "Jeff Sessions (so-called Attorney General) tried to justify separating immigrant children from their parents at the border. He failed. Miserably. Must end this practice. NOW",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "OU5GVFF1",
                "discourse": "For"
            },
            {
                "comment_id": 85,
                "comment": "\"As the son of Eritrean immigrants, I’m deeply grateful to my colleagues on HouseJudiciary for passing the amendment.\"",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "FJ6CPJQX",
                "discourse": "For"
            },
            {
                "comment_id": 86,
                "comment": "I don't see how the Census could actually comply with Trump's Executive Order since the Census form doesn't ask about citizenship or the legal status of the presence in the USA.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "L7BMOQB6",
                "discourse": "Neutral"
            },
            {
                "comment_id": 87,
                "comment": "I joined IngrahamAngle last night and stressed the need for E-Verify so we can ensure a legal workforce, disincentivize illegal immigration, and protect taxpayers.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "UGRP3E76",
                "discourse": "Against"
            },
            {
                "comment_id": 88,
                "comment": "I'm in the White House ahead of today's HispanicCaucus meeting with POTUS and VP. We'll talk about infrastructure, health care access and equity, immigration reform and ways we can deliver for communities like the Inland Empire. Looking forward to this continued partnership.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WKXL7T1O",
                "discourse": "For"
            },
            {
                "comment_id": 89,
                "comment": "Everything that is increasing under this administration is negatively impacting the American people. Increasing cost-of-living, increasing numbers of illegal immigrants storming the southern border, and increases in supply-chain issues, when will this administration do something?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "AEE82WD2",
                "discourse": "Neutral"
            },
            {
                "comment_id": 90,
                "comment": "Immigrants in Colorado are integral to our community and economy’s success. Take, for example, Javier, one of the 17,000 DACA recipients who grew up in Colorado and has been working and raising his family here for decades.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "FS6A7Y82",
                "discourse": "For"
            },
            {
                "comment_id": 91,
                "comment": "Trump and ; Mexican Pres goals: (1) end illegal immigration; (2) secure border; (3) stop cartels; (4) improve NAFTA; (5) keep jobs in hemisphere",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "699OX4EO",
                "discourse": "Against"
            },
            {
                "comment_id": 92,
                "comment": "If she believes that enforcing our immigration laws with physical barriers is immoral, will the Speaker be introducing a bill to destroy the walls and fencing that already exist?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "PP3HY5GD",
                "discourse": "Against"
            },
            {
                "comment_id": 93,
                "comment": "Let’s not end this year the way it began: Another shutdown over the issue of illegal immigration because the Democrats are unwilling to support common-sense measures. I am proud to vote for the additional border security that the House added to government funding legislation.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "T0VV6IVN",
                "discourse": "Against"
            },
            {
                "comment_id": 94,
                "comment": "High cost of illegal immigration. A new study puts it at $135B. this is money we could be using on education, roads and health care",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "1DUCK4LT",
                "discourse": "Against"
            },
            {
                "comment_id": 95,
                "comment": "The Biden Administration says its policies promote a “safe, orderly, and humane” immigration system. LOL. The border crisis is now a catastrophe. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "3IBRZTQ0",
                "discourse": "Against"
            },
            {
                "comment_id": 96,
                "comment": "If you think about it, you don’t see any first world countries really having mass immigration to America. You look at the line that is waiting to get in right now and they’re all from the third world. Why?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "3PFGO3FG",
                "discourse": "Against"
            },
            {
                "comment_id": 97,
                "comment": "African immigrants live the American dream while live the American nightmare. receives categorical support from OfficialCBC while languishes w/ little to no support from HispanicCaucus or CAPAC. Black Americans continue to be the mules of American democracy.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "S7LTWN6I",
                "discourse": "For"
            },
            {
                "comment_id": 98,
                "comment": "Migrants discuss how quickly they were able to receive their NTA papers that legally allow them to continue their travel throughout the US without fear of deportation. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "TS06DNX8",
                "discourse": "Against"
            },
            {
                "comment_id": 99,
                "comment": "I am all for border control and legal immigration; but humanity should ALWAYS come first.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "NUKUS9A0",
                "discourse": "Neutral"
            },
            {
                "comment_id": 100,
                "comment": "Illegal immigrants Joe? Deport them if you can count them. Your out of touch with the main stream American.#Immigration",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "TS477MTW",
                "discourse": "Against"
            },
            {
                "comment_id": 101,
                "comment": "This is how Joe changes the truth to look dirty. Bernie didnt vote for it and many immigrant groups warned against it was stipulations in it mad the immigrants almost like slaves to employers.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "NQII1RV3",
                "discourse": "For"
            },
            {
                "comment_id": 102,
                "comment": "On a day when President Trump is supposed to be embracing a grieving community and celebrating our American diversity in El Paso, his administration is instead stoking fear by conducting massive immigration raids in Mississippi. He is morally unfit to lead this country.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "0M9P7PY2",
                "discourse": "For"
            },
            {
                "comment_id": 103,
                "comment": "The illegal aliens crossing the border don't have to report to immigration court until 2027... Let that marinate ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "43ER8ALA",
                "discourse": "Neutral"
            },
            {
                "comment_id": 104,
                "comment": "Lefty tried making excuses for mass illegal immigration. The last thing the US needs right now are millions of poor, sick and dependent non-English speaking people who don’t want to assimilate.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LHYEYG81",
                "discourse": "Against"
            },
            {
                "comment_id": 105,
                "comment": "Since when so undocumented immigrants have the right to vote? Since when do undocumented immigrants receive benefits from the U.S. Government? They don't because \"undocumented,\" means ILLEGAL!!! WAKE UP!!!!!",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JO0BFREG",
                "discourse": "Against"
            },
            {
                "comment_id": 106,
                "comment": "Secretary Albright’s family arrived in Ellis Island as refugees in 1948, and she rose to become a barrier-breaking leader on the world stage.  She was a force in advancing America’s security, and her warnings about the rise of autocracy remain a guide for us today.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "J39YQNKM",
                "discourse": "For"
            },
            {
                "comment_id": 107,
                "comment": "Bernie has an anti-immigration history. And why would he support asylum seekers when he thinks dictators are so great? He fundamentally doesn't understand the struggles of the global poor",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "BWSRUSHB",
                "discourse": "For"
            },
            {
                "comment_id": 108,
                "comment": "Of course, he is the son of refugees.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "ILM0O39K",
                "discourse": "Against"
            },
            {
                "comment_id": 109,
                "comment": "Empty shelves. Skyrocketing inflation. Record-breaking illegal immigration. This is Joe Biden’s America.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "495MH529",
                "discourse": "Against"
            },
            {
                "comment_id": 110,
                "comment": "Mass legal immigration is no less harmful than mass illegal immigration. It is no less harmful to American communities, American workers and their wages, and ultimately to American sovereignty.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JBQZJ3P7",
                "discourse": "Against"
            },
            {
                "comment_id": 111,
                "comment": "I was very grateful to participate in a naturalization ceremony at Dunn Elementary today. It is because of, not in spite of, immigrants that we grow stronger as a nation every day.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "DUCMFIXL",
                "discourse": "For"
            },
            {
                "comment_id": 112,
                "comment": "One year ago, this Administration began ripping apart immigrant families. Putting children in cages. As I told Astrid_NV and other brave activists today, we can fix our broken immigration system without tossing aside our values.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "AZLE4A1J",
                "discourse": "For"
            },
            {
                "comment_id": 113,
                "comment": "Apparently, if the media cover deportations, this turns deportation into a cruel and unusual punishment, and therefore immigrants must get permanent asylum. A liberal judge might buy it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "8CRQBCY9",
                "discourse": "Against"
            },
            {
                "comment_id": 114,
                "comment": "Tired of no immigration policy? How about this?  U don’t like ur country?  How about we take America to you. Let's start with Mexico.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "2PTAW9X1",
                "discourse": "Against"
            },
            {
                "comment_id": 115,
                "comment": "Republicans aren’t anti-immigration. We just don’t want millions of people walking across our borders unvetted.  ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LPPKT6HU",
                "discourse": "Against"
            },
            {
                "comment_id": 116,
                "comment": "At every turn, HouseDemocrats have ignored the crisis happening at our Southern border and ; refused to fund border security. Instead, they endorse open, unregulated borders and ; want taxpayer dollars going to illegal immigrants.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "45O5B4ZL",
                "discourse": "Against"
            },
            {
                "comment_id": 117,
                "comment": "Finally, the Bristol Detention Centers is closing. The inhumane treatment of immigrants is a stain on our nation. Thank you for doing the right thing, POTUS. Let's keep working to reform our broken immigration system.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "G7Q5T261",
                "discourse": "For"
            },
            {
                "comment_id": 118,
                "comment": "Ten years ago the GOP prevented immigration reform. During the Orange Overlord’s Reich, they did nothing. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "R7F65B1Q",
                "discourse": "Against"
            },
            {
                "comment_id": 119,
                "comment": "Illegal mass immigration is being force upon many nations across the world… It’s as if it’s all orchestrate",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "XGLJSSRA",
                "discourse": "Against"
            },
            {
                "comment_id": 120,
                "comment": "This sad news of a police officer in California killed by an illegal immigrant is just another instance where Democrat policies - like sanctuary cities and open borders - are protecting criminals instead of the American people.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "VO4D55DK",
                "discourse": "Against"
            },
            {
                "comment_id": 121,
                "comment": "If Kathy Hochul were serious about stemming the impact of the, she would call out Biden for his secret flights of migrants to New York and END her Green Light laws. Instead, she is incentivizing MORE illegal immigration.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WNSUNR8P",
                "discourse": "Against"
            },
            {
                "comment_id": 122,
                "comment": "Reforming our broken immigration system is a key component of the plan to move our country forward. Grateful to have a partner in POTUS.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "0OWB9EYW",
                "discourse": "For"
            },
            {
                "comment_id": 123,
                "comment": "Regarding illegal immigration, Florida will not be a sanctuary state, we won’t allow someone here illegally to commit criminal misconduct and we won’t tolerate sanctuary cities that frustrate law enforcement by shielding criminal aliens at the expense of public safety.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "TAN90GEA",
                "discourse": "Against"
            },
            {
                "comment_id": 124,
                "comment": "Instead of dangerous raids, this Administration should invest in true comprehensive immigration reform that recognizes the violence that many immigrants have fled to seek refuge in America and which truly addresses the humanitarian crisis at our border.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "Y7JLM4CD",
                "discourse": "For"
            },
            {
                "comment_id": 125,
                "comment": "“New Migrant Caravan Organizer Arrested in Honduras on Rape Charge” As DHS has warned, the trek to our border is perilous. 1-in-3 women are assaulted. The humanitarian thing to do is to disincentivize illegal immigration by building a barrier!",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "BS4D5R2W",
                "discourse": "Against"
            },
            {
                "comment_id": 126,
                "comment": "I cry for our nation. Where is the honor? The respect for one another? for those fleeing persecution, the elderly, the children, the refugees like so many of us are? We are better than this! Not one, all",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "9M29G32V",
                "discourse": "For"
            },
            {
                "comment_id": 127,
                "comment": "Illegal border crossings just reached a 20 year HIGH while deportations have hit a record LOW The Biden Administration’s immigration policies have caused the humanitarian, security, and public health crisis at our Southern Border!",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "7HOIYO12",
                "discourse": "Against"
            },
            {
                "comment_id": 128,
                "comment": "what the fuck is this disingenuous trash? the \"comprehensive immigration reform\" Biden voted for was 700 miles of border fence. you voted for the PATRIOT Act. you're against sanctuary cities. the Obama/Biden admin deported a record 300 million people. you are actual human scum",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "NJRULG6H",
                "discourse": "For"
            },
            {
                "comment_id": 129,
                "comment": "One bus with migrant ends up in Chicago and residents are worried about its impact on the community. Think about millions in Border States? ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "92SSAHG0",
                "discourse": "Against"
            },
            {
                "comment_id": 130,
                "comment": "It's time to fast-track a living wage, comprehensive immigration reform and higher education affordability",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "NDNDM6KC",
                "discourse": "For"
            },
            {
                "comment_id": 131,
                "comment": "Too little or too much of a good thing is hazardous. Immigration needs some kind of check and balance system, no matter how we swing it. Any Presidential Candidate needs to identify this in immigration reform. Unchecked flow of people is unsustainable.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "X8RX4AMK",
                "discourse": "Against"
            },
            {
                "comment_id": 132,
                "comment": "Millions of undocumented move america forward!With hard work.Pass immigration reform and stop criminalizing people that just work for the betterment of our country",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "53DGVUQB",
                "discourse": "For"
            },
            {
                "comment_id": 133,
                "comment": "That I am able to stand in this chamber today, as the son of African refugees, is proof that the American dream is real. That is why we must pass and give every young immigrant this same opportunity to achieve in America.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "BOG5QZ01",
                "discourse": "For"
            },
            {
                "comment_id": 134,
                "comment": "Sec. Nielsen helped implement a cruel agenda of tearing apart families and putting kids in cages, and her resignation is welcome news. Now, we must make sure that our immigration policy isn't handed to even more extreme voices in the Trump Administration.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WGOIXTX9",
                "discourse": "For"
            },
            {
                "comment_id": 135,
                "comment": "Last night we saw a clear contrast: Democrats w/ no concern for border security and ; no mention of victims of illegal immigration vs. a POTUS who compassionately made the case to secure our border, protect Americans and ; address the humanitarian crisis. On FoxFriendsFirst at 5:15!",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "VMS2LS8O",
                "discourse": "Against"
            },
            {
                "comment_id": 136,
                "comment": "Biden- \"The Comprehensive Immigration Reform Act of 2007 was our best shot at fixing our broken immigration system. It had bipartisan support and would have put millions of immigrants on the pathway to citizenship...Sanders voted against it.\"",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "EJHTE3ML",
                "discourse": "For"
            },
            {
                "comment_id": 137,
                "comment": "We already have the worst illegal immigration in the history of our country & it’s about to get worse. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "VPEOEVZ2",
                "discourse": "Against"
            },
            {
                "comment_id": 138,
                "comment": "One year ago, a white supremacist armed with a semi-automatic rifle targeted the people of El Paso. He thought his hatred of Latinos and immigrants would prove more powerful than the culture and vibrancy of the community. He was wrong.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "7RWN2TPI",
                "discourse": "For"
            },
            {
                "comment_id": 139,
                "comment": "There are more immigrants in our country right now than any other time. Is the country more united? Stronger? Just the opposite and ; everyone knows it. Maybe that's bc our elites welcome immigrants by telling them how flawed America is and how bigoted its native population",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "5NO5W0PT",
                "discourse": "Against"
            },
            {
                "comment_id": 140,
                "comment": "Proud to visit ICEgov in, to personally express my support to the brave men and ; women who help enforce our immigration laws. Fighting for a safe and ; secure America, with secure borders and ; strong law enforcement.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "2LUJRVTI",
                "discourse": "Neutral"
            },
            {
                "comment_id": 141,
                "comment": "Our ruling class prefers immigrants to Americans. Who are they more worried about those here illegally or citizens? FoxNews",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "OAQDN43R",
                "discourse": "Against"
            },
            {
                "comment_id": 142,
                "comment": "Homeless veterans are now being booted from new york hotels to make room for migrants. These are the results of illegal immigration",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "H6HYK5QX",
                "discourse": "Against"
            },
            {
                "comment_id": 143,
                "comment": "Conservatives should be making clear that we support LEGAL immigration and are working to stop ILLEGAL immigration. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "XJ8BH307",
                "discourse": "Neutral"
            },
            {
                "comment_id": 144,
                "comment": "NOPE. Legal immigration needs to be cut back severely, too. We are long past the numbers where we can integrate legal or illegal immigrants for at least a decade. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "OOGMJ1QS",
                "discourse": "Against"
            },
            {
                "comment_id": 145,
                "comment": "As Members of Congress, we have the responsibility to ensure that people being detained by the U.S. government are properly cared for while in custody. The Trump Administration’s inhumane treatment of immigrants is cruel and dangerous and Runs counter to our American values.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "HE5ZUBLL",
                "discourse": "For"
            },
            {
                "comment_id": 146,
                "comment": "One year ago today the House passed to tell every young that their We must continue to fight to ensure young immigrants can come out of the shadows and that they are given the same opportunity that my parents were given to achieve in America.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "8AYYORYI",
                "discourse": "For"
            },
            {
                "comment_id": 147,
                "comment": "We must ensure for every Dreamer by providing a pathway to citizenship. We are a nation of immigrants. Let’s live up to our values.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "4ETDZ979",
                "discourse": "For"
            },
            {
                "comment_id": 148,
                "comment": "As a son of Eritrean refugees, let me be clear: The President’s travel ban on African countries contradicts our American values and ; the promise and refuge our country has offered to immigrants and refugees for centuries. It is unconscionable. It is wrong. And we must oppose it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "E2TQQJBS",
                "discourse": "For"
            },
            {
                "comment_id": 149,
                "comment": "Here's Bernie mocking immigrants who take jobs as lifeguards and teachers.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "OV3XCJ2Z",
                "discourse": "For"
            },
            {
                "comment_id": 150,
                "comment": "As the son of immigrants, I agree w/ POTUS: It is time to pass comprehensive immigration reform and ensure for young immigrants living in the shadows.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "E1OFU0DG",
                "discourse": "For"
            },
            {
                "comment_id": 151,
                "comment": "I'm supporting compromise immigration legislation that addresses immigrants who were protected under DACA, provides funding for border security, and ends the separation of families at our border. Read more:",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JN1PLQNC",
                "discourse": "For"
            },
            {
                "comment_id": 152,
                "comment": "Pelosi told Capitol police to arrest any of my staff that refused to wear a mask… yet Biden and ; Pelosi are letting almost 200k illegal immigrants per month pour across our southern border w/o regard to the spread of COVID across our country. Still they say they care about America?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "TTMESCDI",
                "discourse": "Against"
            },
            {
                "comment_id": 153,
                "comment": "Three-fourths of undocumented immigrants in the labor force are classified as essential. They could also contribute $149 BILLION in spending power each year if they became US citizens. Citizenship isn’t just a moral issue; it’s an economic one.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "W221ZSTI",
                "discourse": "For"
            },
            {
                "comment_id": 154,
                "comment": "As a son of immigrants, I’m honored to be appointed as Vice Chair of the HouseJudiciary Subcommittee on Immigration and continue our work with Chair RepZoeLofgren to protect, support refugee resettlement and ensure immigrants are treated with humanity and dignity.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "ALL5BYCG",
                "discourse": "For"
            },
            {
                "comment_id": 155,
                "comment": "I support, and all of the members of the Republican Conference support, a plan that keeps families together while their immigration status is determined.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "X4LOTD6C",
                "discourse": "Neutral"
            },
            {
                "comment_id": 156,
                "comment": "The possibility that immigration could hit, or even exceed 1,000,000 is terrifying. The fact that the government appears prepared to indulge this is dangerous, irresponsible and completely unacceptable.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "WHNHN3J8",
                "discourse": "Against"
            },
            {
                "comment_id": 157,
                "comment": "For the 'bros - This is why the immigration activists don't like Bernie. And his votes against background checks are why the gun safety people hate him. And his promise to close all the nuclear power is why environmentalists hate him. He is losing because of his policies.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "ZGJ2V3BB",
                "discourse": "For"
            },
            {
                "comment_id": 158,
                "comment": "This is a cruel decision with disastrous consequences. To current recipients, you are safe here. To our young immigrants, we will not stop our work until very Dreamer is treated as they are: American.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "E44GJOWE",
                "discourse": "For"
            },
            {
                "comment_id": 159,
                "comment": "Attempts to compare President Trump and President Obama on immigration are far-fetched.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "FCWB06ZC",
                "discourse": "Neutral"
            },
            {
                "comment_id": 160,
                "comment": "We could go further and work to improve the conditions that drove them to our borders. If we weren't racist uncaring reeds in the wind, that is.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "FP0ZUBZX",
                "discourse": "Neutral"
            },
            {
                "comment_id": 161,
                "comment": "Holy ! He forgot he was president or his admin team did.... ?!?! Does Joe Biden not control the immigration laws now?",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "GF0N65X6",
                "discourse": "Neutral"
            },
            {
                "comment_id": 162,
                "comment": "With another potentially devastating storm bearing down on Puerto Rico and the South, the Trump Administration is diverting disaster aid to fund a cruel and broken immigration system. This president is putting American lives at risk.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "8LJ1EX0R",
                "discourse": "For"
            },
            {
                "comment_id": 163,
                "comment": "FACT: President Biden’s immigration crisis at the US-Mexico border is not just impacting southern border states. EVERY state, city, and community is facing consequences. In, Northern Border Agents are dangerously understaffed, risking the security of the US-Canada Border.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "57MEB70I",
                "discourse": "Against"
            },
            {
                "comment_id": 164,
                "comment": "Send them to white, Latino, Asian, African, Caribbean areas.  No more destabilization of Black American Freedmen, who have been in this country for centuries, paying taxes and fighting in wars. Our tax dollars should not be funding immigrants.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "OGAHJ4SS",
                "discourse": "Against"
            },
            {
                "comment_id": 165,
                "comment": "I’ve never seen so many racists in one place! How dare they argue that illegal immigration is a problem. It saddens me when black people become white supremacists.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "TB2X2GCS",
                "discourse": "Against"
            },
            {
                "comment_id": 166,
                "comment": "Filling shelters with children who were ripped from their parents is not sound immigration policy, it’s outright cruel. We have to be better than this.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "YOSM9E9Q",
                "discourse": "For"
            },
            {
                "comment_id": 167,
                "comment": "America is a nation of immigrants. Each new generation that comes to our country makes us stronger. That became even truer yesterday when luisanaperezf, part of our campaign team in Florida, became a U.S. citizen. Thanks for choosing us, Luisana.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "PFRI71SD",
                "discourse": "For"
            },
            {
                "comment_id": 168,
                "comment": "In March, President Biden falsely claimed that illegal immigration was just a seasonal trend that happens in the winter months. In June and July, he shattered records with more than 400,000 border crossings. The problem isn't seasonal. The problem is Joe Biden.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "K12IV8JD",
                "discourse": "Against"
            },
            {
                "comment_id": 169,
                "comment": "There is a crisis at our southern border. Instead of addressing this crisis Joe Biden and House Democrats are doubling down on their failed policies that are INCENTIVIZING illegal immigration and creating chaos across our nation.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "XHSGD9I0",
                "discourse": "Against"
            },
            {
                "comment_id": 170,
                "comment": "Trump launched his 2016 campaign by calling Mexicans rapists. He's spread racism against our Latino community ever since. We need to work in partnership with Mexico. We need to restore dignity and humanity to our immigration system. That's what I'll do as President.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "P3N038FH",
                "discourse": "For"
            },
            {
                "comment_id": 171,
                "comment": "This, I want to celebrate all the contributions immigrants have made in America. For every immigrant in my district, in Colorado and across America, know that you belong here. This too is your country.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "RQF7Z45N",
                "discourse": "For"
            },
            {
                "comment_id": 172,
                "comment": "Trump is fighting tooth and ; nail to deny those fleeing dangerous situations their right to seek asylum in our nation. We should uphold our moral responsibility and ; enforce our immigration laws with dignity—not turn away those fleeing violence, war, and ; poverty.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "ZT4X275F",
                "discourse": "For"
            },
            {
                "comment_id": 173,
                "comment": "On day one, I will send a bill to Congress providing a roadmap to citizenship for 11 million undocumented immigrants and take action to protect Dreamers.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "83V458OM",
                "discourse": "For"
            },
            {
                "comment_id": 174,
                "comment": "With our communities behind us, the HispanicCaucus and our colleagues will continue fighting for immigration reform. The time to act is now.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "88UY3MU7",
                "discourse": "For"
            },
            {
                "comment_id": 175,
                "comment": "Biden’s Border Crisis constitutes a catastrophic failure of leadership. While Washington does nothing to stop the flow of illegal immigration into our states, Florida has passed concrete laws to defend our state against the consequences of Biden’s dereliction of duty.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "7CDS4LLD",
                "discourse": "Against"
            },
            {
                "comment_id": 176,
                "comment": "It’s time to stand up for, and for the immigrants who have built lives in this country. Glad to have POTUS with us in this fight.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "BPQVOIX2",
                "discourse": "For"
            },
            {
                "comment_id": 177,
                "comment": "Invasion at the US southern border. Looking across the river at Matamoros, MX from Brownsville, TX. Crowds of migrants continue to gather with the intention of crossing illegally into the U.S. The two men in the green are Mexican immigration officials.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JO9Z1P1G",
                "discourse": "Against"
            },
            {
                "comment_id": 178,
                "comment": "I find it very funny that Europeans love to belittle the US at every turn but would move instantly over there if they got a job or internship.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "J99LH4GL",
                "discourse": "Neutral"
            },
            {
                "comment_id": 179,
                "comment": "Despite intentionally hateful fearmongering from certain legislators, the end of Title 42 is not \"chaotic,\" nor is there an \"invasion.\" Just people who sacrificed everything & survived a torturous journey calmly waiting to \"do it the right way.\"",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "JZF7XWZQ",
                "discourse": "For"
            },
            {
                "comment_id": 180,
                "comment": "Hey Joe, A president can embrace a grieving community and ; protect our country at the same time. Sad that you blame the deaths of these victims on our president, and ; constantly bash him. Remember when you criticized Obama for deporting 3 million immigrants??? Neither do I....",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "6SV3AW68",
                "discourse": "Against"
            },
            {
                "comment_id": 181,
                "comment": "Worksites across the U.S. state of Florida were left empty after it passed new immigration reforms. Around 900,000 workers are undocumented there.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "ZUZ47Y15",
                "discourse": "Against"
            },
            {
                "comment_id": 182,
                "comment": "The bill was a compromise based largely on three previous failed immigration reform bills: A larger group of senators was involved in creating the bill, sometimes referred to as the \"Gang of 12\". You should be telling people what was in the bill not who voted for it.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "OS3H5I30",
                "discourse": "For"
            },
            {
                "comment_id": 183,
                "comment": "Proud to support this legislation to rebuild our broken immigration system. It's time we had immigration policy that represents our values as Americans.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "1UYFTC6U",
                "discourse": "For"
            },
            {
                "comment_id": 184,
                "comment": "As we work to pass immigration reform that strengthens our border and addresses DACA, I'm pleased to join in support of the Family Reunification Act to reunite children that were recently separated from their parents along the southern border. Read more:",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "1RARX3FO",
                "discourse": "For"
            },
            {
                "comment_id": 185,
                "comment": "Joe JoeBiden Americans supports his immigration policy. We are tired of you Democrats supporting illegal aliens first over U.S. Citizens. You have just proved to the American people that you are not worthy to be President of the United States. Trump thinks about Americans first.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "V3R3KUMC",
                "discourse": "Against"
            },
            {
                "comment_id": 186,
                "comment": "If you haven't yet listened to this in its entirety - please stop what you are doing and take 6 minutes to do so. As the daughter of African immigrants, thank you RepJoeNeguse",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "D7CACAJI",
                "discourse": "For"
            },
            {
                "comment_id": 187,
                "comment": "It looks like illegal immigration isn’t super popular with Black residents in Chicago. Seriously this is the response to 250-500 illegal immigrants. Imagine dealing with the MILLIONS like our border states. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "SM89VFW1",
                "discourse": "Against"
            },
            {
                "comment_id": 188,
                "comment": "Once Biden and Mayorkas waved through over 5.5 million illegals without vetting them , over 21 months, it became a free-for-all. ",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "QOXN0EVT",
                "discourse": "Against"
            },
            {
                "comment_id": 189,
                "comment": "Last night, I spoke on the House floor on the need to protect American workers, give them freedom and ; independence. I was booed and ; heckled by Democrats. They would rather protect illegal immigrants and ; give them union memberships (when they shouldn't be working here in the 1st place)",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "NEHJQ6EH",
                "discourse": "Against"
            },
            {
                "comment_id": 190,
                "comment": "Home care workers and child care workers — who are more often women, women of color, and immigrants — have been underpaid, unseen, and undervalued for far too long. That will change with my administration:",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "FMK92VG7",
                "discourse": "For"
            },
            {
                "comment_id": 191,
                "comment": "America has long stood as a beacon of hope for refugees from around the world who are “yearning to breathe free.” The Trump Admin’s cruel anti-immigrant, anti-refugee agenda dishonors our heritage and ; threatens the lives and ; well-being of countless people.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "5IR2Q9NZ",
                "discourse": "For"
            },
            {
                "comment_id": 192,
                "comment": "I would not let our Government run a hot dog stand —their stance in illegal immigration  is awful",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "7SGH9AGJ",
                "discourse": "Against"
            },
            {
                "comment_id": 193,
                "comment": "It is mean-spirited to allow people to cut the immigration line. People have been waiting years to get interviews and visas. Support legal immigration - stop Sanctuary Cities.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "LX1VKYDD",
                "discourse": "For"
            },
            {
                "comment_id": 194,
                "comment": "Backdoor immigration through the student visa scam is contributing to our population explosion and strain on resources and public services",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "S50T4HB6",
                "discourse": "Against"
            },
            {
                "comment_id": 195,
                "comment": "We must restore our nation's commitment to humane and effective immigration policies. As president, I'll provide a fair and just system that helps to grow and enhance our economy, and secure our cherished values.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "8I9M2VFB",
                "discourse": "For"
            },
            {
                "comment_id": 196,
                "comment": "Republicans & Democrats have no solution to the migration crisis because neither is focused on the black market created by restricting immigration w/o providing means to prevent unauthorized entry or means to process migrants in a timely manner",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "KW51H3RM",
                "discourse": "Neutral"
            },
            {
                "comment_id": 197,
                "comment": "This administration's demonization of immigrants must end. Their targeting of families and children puts lives at risk, and does nothing to reform our immigration system.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "3J2LF0AY",
                "discourse": "For"
            },
            {
                "comment_id": 198,
                "comment": "Bit of a disconnect with the real Biden who called immigrants \"aliens\" at the debate tonight.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "N9AP6MG9",
                "discourse": "For"
            },
            {
                "comment_id": 199,
                "comment": "Trump's immigration policies are an assault on human dignity. We aren't a country that denies children soap and a toothbrush. This is not who we are.",
                "related_to": "Immigration",
                "discussion_id": "IM",
                "discussion_name": "Immigration",
                "user_id": "RZKF7290",
                "discourse": "For"
            }
        ],
        "discourses": [
            {
                "discourse_name": "For",
                "count": 93
            },
            {
                "discourse_name": "Against",
                "count": 88
            },
            {
                "discourse_name": "Neutral",
                "count": 19
            }
        ],
        "discussion_id": "IM",
        "discussion_name": "Immigration",
        "number_of_comments": 200,
        "ngrams": [
            {
                "ngram": "illegal immigration",
                "count": 29
            },
            {
                "ngram": "immigration system",
                "count": 19
            },
            {
                "ngram": "illegal immigrants",
                "count": 18
            },
            {
                "ngram": "immigration reform",
                "count": 15
            },
            {
                "ngram": "broken immigration",
                "count": 11
            },
            {
                "ngram": "southern border",
                "count": 11
            },
            {
                "ngram": "nation immigrants",
                "count": 7
            },
            {
                "ngram": "border security",
                "count": 5
            }
        ]
    }
]